{
  "preSchool": {
    "theChallenge": {
      "title": "The Challenge",
      "text": "Preschool builds the foundations for life-long learning and yet 16% of children in Kenya do not attend preschool. Like five-year-old Evans whose parents live on less than $2 a day in the sprawling informal settlement of Kibera. Evans’ parents are already paying school fees for three older siblings in primary school and cannot afford the fees to send Evans to preschool as well.When both parents are busy making ends meet, Evans is left with a neighbour. She keeps an eye on him but its easy enough for the inquisitive child to wander off exploring. The risks are numerous to a small child in Kibera. Turning Point’s Preschool provides a safe environment for children like Evans to learn and thrive."
    },
    "ourApproach": {
      "title": "Our Approach",
      "text": "We run a free preschool for children like Evans in Kibera who don’t have the opportunity to attend a preschool.Our preschool provides a safe environment for children to play, explore and grow. Each day involves a fun-packed programme of play-based learning, circle games and sports. The kids receive a healthy breakfast and lunch each day and our social workers work closely with families to promote positive parenting at home."
    },
    "ourImpact": {
      "title": "Our Impact",
      "text": "Evans is now in our preschool learning to count and read. He loves doing puzzles and building houses and cars out of playdough. He makes lots of noise with his friends as they play football on the playground. Evans is gaining the foundational knowledge that will help him to do his best in primary school."
    }
  },
  "schoolTransition": {
    "theChallenge": {
      "title": "The Challenge",
      "text": "When you walk the cramped alleys of Kibera you come across many children who should be in school. Instead they are playing in the streets, running errands for their parents or caring for their siblings. Some collect recyclable items out of rubbish mounds to sell for a little pocket money.Poverty is the main barrier keeping these kids out of school. Their parents cannot afford the cost of sending them to school. Though primary education is free in Kenya, the underfunded and over-subscribed schools charge for many things. From admission to the feeding programme to the pupil’s desks."
    },
    "ourApproach": {
      "title": "Our Approach",
      "text": "We work with children who have dropped out of school and support them to return to education. Our school transition programme enrols children in our free primary school and provides extra support as they settle back into school.What kind of support do children receive?Each child is paired up with a student buddy who helps them make friends and find their way around the schoolEach child also has a Mentor Teacher who helps the child set goals, overcome any challenges they are facing and identify where the child might need extra social or academic supportFinally, we help each child catch up on the learning they missed while they were out of school through remedial classes."
    },
    "ourImpact": {
      "title": "Our Impact",
      "text": "Collins is a rapper; he loves to make up his own songs. A crowd of excited Turning Point kids were wowed by Collins performing one of his songs around the campfire at our annual holiday camps. Collins is also an orphan and was living on the streets, completely homeless with no one to take care of him and no home to sleep in at night.Turning Point was able to reconnect Collins with an uncle who he now lives with.Collins was way behind in his education, but it’s never too late to make a change. At 16, he was unable to read or write but Collins is a determined young man and worked hard in Transition Class to catch up. He has persevered and shown amazing progress and is now in Class 8, the equivalent of Year 10 in the UK. He will be taking his final primary school exams this year at age 19. What’s more, he can now write his raps down."
    }
  },
  "foundationOfHope": {
    "theChallenge": {
      "title": "The Challenge",
      "text": "In the few government schools that surround Kibera, a child will share a classroom with 50 to 70 other pupils. In the small non-formal schools run within the slum, a child can share a textbook with 6 other children. Class sizes may be smaller but often the teacher is not trained. As a result, many 10 year olds in Kibera are unable to read at the level of a 7-year-old.It is also very rare to have opportunities for arts, drama, music or sports and many talents go unnoticed."
    },
    "ourApproach": {
      "title": "Our Approach",
      "text": "At the Fountains of Hope school, we focus on quality and aim to develop the whole child. Each class has no more than 25 pupils, our classrooms are spacious and bright with enough textbooks and learning materials for all. Our pupils enjoy a free feeding programme to keep hunger at bay so they can concentrate in class and grow healthily. Our children study the national curriculum and take extra classes in discipleship, I.T., sports and creative arts.Because we work with children from difficult backgrounds, our social worker and pastoral team are vital to our work. We help children to overcome their challenges by building their self-esteem and confidence.We let them know there is always someone on their side rooting for them."
    },
    "ourImpact": {
      "title": "Our Impact",
      "text": "Lydia is a shy but ambitious 14-year-old whose heart is as warm as the steaming morning chai served at the Fountains of Hope School. She likes nothing more than to hear her four siblings giggling as she shares stories from her day at school. But life isn’t easy for Lydia as her parents are both addicted to alcohol. When social workers visited their home they found the two parents passed out on a single mattress in an otherwise empty room. Lydia and her siblings are largely neglected by their parents.Lydia joined Turning Point through the School Transition Programme and now attends the Fountains of Hope Primary School. Lydia’s shynessis being gradually replaced by confidence.She recited a memory verse at the opening of the new Fountains of Hope School buildings in January 2016. She is now in Class 6, the equivalent of Year 8 in the UK, and is benefiting from the friendshipsshe is building with her class mates. These more settled confidence-building surroundings are helping Lydia to perform well academically and she regularly finishes in the top five in her class’s exam results.The care she receives at Turning Point and the new friendships she has made are making a big difference to Lydia. Our prayer is to continue offering Lydia and all the pupils at Fountains of Hope plenty of opportunities to learn and grow. We want to see them build their confidence and reach their full God-given potential."
    }
  },
  "communityLibrary": {
    "theChallenge": {
      "title": "The Challenge",
      "text": "Many children in Kibera return from school to a 10 ft by 10 ft one-roomed home with no school books, no desk to work at, poor lighting and noise and distractions from other family members. Completing their homework or doing revision in this environment is incredibly difficult. Many of the small schools in Kibera are unable to provide enough textbooks and don’t provide any further reading material. There is no option for children to research a topic that interests them further.There is no opportunity to develop their literacy and imagination by sitting down with a storybook."
    },
    "ourApproach": {
      "title": "Our Approach",
      "text": "We provide a quiet well-lit space packed full of books and learning resources for children and families in the community to use. Children come every evening to do homework, read their favourite stories and read more about snakes, aeroplanes, ballet dancers or any topic that interests them.We aim to compliment what children are learning in school with additional learning opportunities. We organise spelling competitions and holiday art workshops."
    },
    "ourImpact": {
      "title": "Our Impact",
      "text": "Matasia is 13 years old and in his final year of Primary School at a non-formal school in Kibera. He uses the Turning Point Community Library regularly to do homework and read stories. He loves the wonder of science andhis favourite book, You are here by Christopher Potter, is all about the history of our universe. Matasia says, When I am at home I have a lot of chores to do and I am often sent by my mum to fetch water or go to the shop. Also it is very dark in our house, even during the day. The community library is making a big difference to Matasia who says, I’m improving my reading skills when I read the storybooks. Also, in my school we don’t have enough textbooks so when we are given homework it can be a challenge to copy down all the questions before I leave school."
    }
  },
  "schoolSupport": {
    "theChallenge": {
      "title": "The Challenge",
      "text": "The number of children completing primary school and going on to secondary school in Kenya continues to be low. Only about 56% of secondary school age children are enrolled in secondary school (Kenya National Bureau of Statistics). Career opportunities for those with no further education beyond primary school are limited."
    },
    "ourApproach": {
      "title": "Our Approach",
      "text": "We support children to attend secondary schools and vocational training. We enable children to gain the further education and practical skills they need to start their chosen career."
    },
    "ourImpact": {
      "title": "Our Impact",
      "text": "An 11-year-old Elijah first came to Turning Point after his uncle brought him to Nairobi from his rural home. Elijah’s parents were very poor and the concerned uncle wanted Elijah to have more opportunities. Elijah had not missed a lot of school so Turning Point sent him straight back to primary school which he completed in 2010. Likeable and outgoing, Elijah had no problem making friends in a new place. He joined the Turning Point Football Team and never missed a practice. Every year, he joined other children supported by Turning Point to attend a holiday camp. His absolute favourite activity at camp was swimming.After primary school, Elijah went on to study mechanics at a polytechnic college. He earned his certificates after two years and underwent an internship. He so impressed his boss with his skills, hard work and character that he had a job all lined up at a garage in Nairobi when he finished his course.Elijah’s life has turned around – from a poor rural home with very few opportunities to a well-paid and steady job in the city.Elijah has worked hard and grown into a responsible young man who Turning Point are so proud to have a relationship with."
    }
  },
  "whereWeWork": {
    "theChallenge": {
      "title": "The Challenge",
      "text": "We work in Kibera, a vast slum in Kenya’s capital city, Nairobi. It’s unclear just how many people live in Kibera but estimate’s range from 170,000 to 500,000 people living in just 2.25 square kilometres. That’s about the size of Hyde Park and Kensington Gardens in London."
    },
    "ourApproach": {
      "title": "Our Approach",
      "text": "Residents often live in cramped one-roomed homes mostly made of mud and iron sheets. Water is collected in jerry cans from water points dotted around the slum. There are no public schools, hospitals or clinics in Kibera though there are many run by community members and NGOs. A good number of homes have access to electricity but many rely on paraffin lamps for lighting.Kibera is a lively place to be. As you walk around you hear music blaring, the sound of men and women at work, friends and neighbours talking, business-people selling their wares, children giggling and playing. Life is hard for many in Kibera but many face those challenges with ingenuity and strength of character. Kibera is a place of great potential."
    },
    "ourImpact": {
      "title": "Our Impact",
      "text": "This is the context where we work to provide opportunities for children and families to achieve their full God-given potential."
    }
  },
  "blog": [
    {
      "title" : "Restored Hope",
      "date": "March 10, 2023",
      "preview": "I was locked out of my house by my landlord because I had not paid rent for months. I felt hopeless...",
      "text": "I was locked out of my house by my landlord because I had not paid rent for months. I felt hopeless. Ihad nowhere to go and no food to feed my 8-year-old daughter.My neighbour, at that time, told me about a project that was offering porridge to little children every morning. She took me to this project where I met Pastor Shadrack who welcomed us so warmly. I also saw several children with no shoes eating their porridge with so much joy and satisfaction. My daughter was served a cup of porridge.I told Pastor about my plight, and he asked me to bring my daughter, Mercy, every morning for porridge. It was not long before Mercy was enrolled into a government primary school by the project. She had new uniform, new shoes. She loved going to school.Mercy graduated from the college of fashion and design and is now running her own design shop inNairobi.As for me, I am a beneficiary of the Kinangop Farm project run by Turning Point and a proud owner of a 1 acre piece of land and a decent house.I am filled with gratitude because God brought relief to my life and my children through Turning Point.-Mama Nzembi, Parent",
      "picture": "/assets/images/blog-restored-hope.jpg"
    },
    {
      "title": "Turning Point Is Always My Home",
      "date": "February 23, 2023",
      "preview": "I joined Turning Point not long after it was started. I remember Pastor Shadrack visiting homes...",
      "text": "I joined Turning Point not long after it was started. I remember Pastor Shadrack visiting homes, door to door, looking for children who were out of school. Most people in the community would close their doors in his face, because during that time there were stories going round about a certain local preacher accompanied by a white person who would take children from their parents in the name of wanting to support them in school but then the children would never be seen again. Rumours had it that the preacher trafficked the children to countries far from Kenya. Parents from the community were very afraid. They told their children that whenever they see a Mzungu (white person) they should run away. I grew up believing that wazungu (white people) were not very good people.\n\nSo, one day, Pastor Shadrack knocks on our door, with him was Jon Parsons, a mzungu! I have never been that afraid. But there was a way they spoke to my parents, which was very gentle and honest. They told my parents about their project that offered breakfast to children. They went on saying that there was Bible teaching for the children and fun activities. At that time, my 2 younger sisters and I, ages between 3 and 6, had not started school. Despite the rumours and the fears, my parents agreed to let Pastor Shadrack and Jon to enrol us into the project.\n\nEvery morning we would go to the centre, Mama Judy would serve us some warm, sweet porridge and Pastor Shadrack would teach us songs and some memory verses. We would then go back home around 11am. To date, I still remember some of the verses. They have really helped me through different situations in my life.\n\nI remember our first classroom was a small, cramped and not so well-lit single room. But we enjoyed it regardless. We looked forward to going to the project every single day. It was not long before playtime was extended from 11am-12pm and we couldn’t be happier! We were thrilled! More time in the centre! More time with mama Eunice, mama Judy, babu Kariuki and Pastor Shadrack. More time away from home.\n\nMore and more children joined us at the centre with time. And with the increased number, the small room was expanded to accommodate all of us. Then mama Judy started serving us lunch over and above the cup of porridge. By this time, we were leaving school at 1pm.\n\nThe daily routine of breakfast, Bible teaching, songs, playtime then lunch went on for quite some time. A few parents got tired of waiting for Turning Point’s next move and took their children to “proper” schools. They felt that TP was wasting their children’s time. Many of us stayed on, continuing with the routine, because our parents could not afford to take us to “proper” schools.\n\nFinally, Turning Point started enrolling us into school. Many preschools declined to take me in. They said I was too old for preschool. And so, Pastor Shadrack talked to a headteacher at a nearby primary school to allow me to join grade 1 at their school. After many days of back and forth between the headteacher and Pastor Shadrack, I was allowed to join grade 2. In the beginning, I did not enjoy school at all, because I had no preliminary education and I had not been to a proper class before. I really struggled to catch up. I can confirm that preliminary education is important as it affects a child’s literacy, numeracy and writing skills even beyond school.\n\nThanks to my father who one day promised to buy me a hand video game if I moved from position 90 to 15 in my school assessments. I remember working harder than ever before. Sadly, he passed away before I could show him my results. Before he could buy me the video game.\n\nWe had to go upcountry for his burial and ended up staying there because mum could not support all of us in Nairobi. My elder brother got a chance to continue with his secondary education back in Nairobi and I felt lucky that he asked me to go back with him. My 2 sisters did not get the chance to continue their education.\n\nSo, I rejoined Turning Point and continued with primary education in a government school. I remember Turning Point providing us with full school uniform, a bag and school items. Not forgetting a brand-new pair of shoes! We felt loved and wanted. Every day on our way to school, we would pass by the centre to have breakfast. Mama Judy was always ready with tea and mandazi (doughnut).\n\nIn secondary school, because of my good grades and discipline, I got elected as the school president. What an honour it was! I attribute this success to the Bible teaching and life lessons given to me by Turning Point earlier on.\n\nMy highlight will always be the holiday camps! All of us would come together from different primary schools. There were loads of fun activities. We would have campfires, drama, singing, competitive games, talent shows and nyama choma (roast meat). Oh, and swimming! The last days of camps were always the saddest. We did not want to go back home.\n\nI also liked how Turning Point offered food to our parents to sustain us during school holidays. Turning Point would engage us during holidays with activities that kept us away from the streets and bad company.\n\nI am very grateful for where I am today. I owe it all to Turning Point. They got me from a hopeless situation, where life was very difficult with no hope for education and a future. I am a Diploma holder and I would like to one day advance my qualifications to Bachelors level. I  am currently working as a sales coordinator at a company in Nairobi. I also run my own business on the side. My life is so much better now.\n\nTurning Point will always be my home. Thank you, Turning Point.\n\n– Boniface Onyango – Turning Point Trust Alumnus",
      "picture": "/assets/images/blog-turning-point-my-home.jpg"
    },
    {
      "title": "A Not So Brief History of Turning Point Trust (Part 2)",
      "date": "February 20, 2023",
      "preview": "In April 2002 we took a trip to Kenya to meet up with Kariuki, Pastor & Eunice and finalise plans...",
      "text": "In April 2002 we took a trip to Kenya to meet up with Kariuki, Pastor & Eunice and finalise plans. These were pre-mobile phone times, only very poor dial-up email, so it was difficult to communicate with them when we weren’t actually there. Shortly after we landed Jon had a relapse of his MS. It was particularly bad that time. He was numb in one half of his body and couldn’t really walk. One side of his face locked up and he couldn’t smile. He was pretty much confined to the bedroom of our friend’s house. We tried to see a doctor but there is hardly any prevalence of MS in Kenya, so it was virtually unknown. As a result of this, I did all the meetings. Kariuki came to the house. He was shocked when he saw Jon. I had a list of things to talk to him about in a notebook. He asked if he could start with things that he, Pastor and Eunice had thought about whilst they’d been praying. Being senior to me, I naturally deferred to him. As he talked, unaware of my list and our own ideas, he literally covered every single point Jon and I had written down in the UK. The confirmation of God’s leading and the unity of the team was so encouraging and reinforced the peace we already had about coming and doing this, despite how “risky” and “foolish” people in the UK felt it was.\n\nIn August 2002 our firstborn, Hannah, arrived. By now we had sold the house we had just started paying for when we got married and were living with other people. Adapting to a new baby we also packed up our belongings, some things into crates to be shipped, the rest to my parents’ attic. When Hannah was 2 months old, we said the most painful and difficult goodbye to our parents at the airport and got on the plane. On my side of the family Hannah was the first grandchild for almost 30 years. It felt so costly and like I was being so cruel to my family. There were times I told God that He was asking too much. Yet all the way through we’d had such peace.\n\nWe arrived in Nairobi 23rd Oct 2002. Unqualified, naïve, but part of our hearts was already there, and we were trusting in God who knew far more than we did. From that day onwards Jon never once had any MS symptoms. After five years with nothing at all he was totally discharged from the UK consultant doctors that he was under. At the time we went to Kenya, they had said that a hot climate would cause issues for him. In 2007 some new research came out which totally changed the way they thought about this disease, with the discovery of a direct beneficial link to Vitamin D from sunshine. This is why there is so much of this illness in the Northern hemisphere, but virtually none on the equator. But of course, God already knew that.\n\nAt this point, if you go to the website and it probably says “it all started with a pot of porridge”. We did indeed begin with uji, in March 2003 after several months’ prayer and planning. We served it after most children had gone to school, so we knew those that came were those who really needed to benefit. I think Jon and I, Pastor Eunice and Kariuki will never forget that first group of children who came. They got uji, outside games, singing and love. That was about it. We operated from two tiny rooms on the current TP Mashimoni site and within a very short period 60 children were crammed in their daily. We did not own any other rooms and the playground area was a fenced off dumping site. Three weeks after starting, local meddling and opposition closed the whole project down and we ended up being investigated by CID. This was a very intimidating and incredibly anxious time especially for Jon and I as foreigners, but we had nothing to hide. We had determined there was no corruption from day one, because you cannot build God’s work on a rock with cracks in. After investigating they found absolutely nothing and realised the heart of the work was genuine. Whilst the community watched and speculated, we ended up with a letter from the Office of the President on the wall commending the work of Turning Point and giving it full permission to continue. God is bigger than any system, even any corruption and dirty dealings, and He will establish His work if we only trust and wait and don’t try to fix it ourselves by taking short cuts.\n\nThe rest – as they say – is history. But history that is always in our hearts, and history that has so many more stories of His incredible faithfulness. The way we found staff, the farm, the new school building, it’s all impossible that we should have that except for God.\n\nGod in His faithfulness allowed us twelve years in Kenya, a country that often feels more like our home than the UK. In 2014 we passed on the baton and have been so happy to see new directions, partnerships and developments that would not have been possible were we still there. We planned to try and visit as a family in 2020 but with the pandemic it ended up being 2022.\n\nI can hardly describe the joy of being physically present with many staff that continue with Turning Point to this day, some that we have known since the very first day 03.03.03. For the first time, we were able to finally see the Fountains of Hope school. Looking at this built-for-purpose structure where once we had a few dark rooms and a rubbish dump, was incredible. A full two-storey primary school (age 6-14), registered with the Ministry of Education. A whole I.T. suite which even the youngest classes can access – right there in the heart of Kibera! These days Nairobi is well-renowned as the tech hub of Africa, so this is vital for their working futures. Teachers who have accessed a variety of specialist training and have resources and a huge photocopier. Social workers who understand the very difficult backgrounds many of the pupils come from and can work alongside parents and teachers. Successful sports programmes that not only encourage skill but mentor the children. Discipleship classes that ensure each child knows that regardless of academic attainment, they are loved and of worth in God’s sight, a core part of TPT since the beginning. And at the Kianda and Laini Saba sites, specialist transition classes for children not able or ready to access full education, as well as a library full of books and a safe lit space for homework. UK folk might not appreciate how remarkable that is, but in the heart of Kibera, coming from one room homes without books, lit with kerosene lamps, that is no small thing. None of this is a small thing. For those benefiting, it is literally life changing.\n\nThe work of Turning Point has had different seasons, shapes and forms over the years but everything it is, and everything it will be, in is in God’s hands and by his grace. To Jon and I it seems incredible that twenty years have passed since such humble beginnings. Not one of us who started on day one was “qualified” on paper, but our hearts were for a forgotten community of children & families and we were willing to take God at His word. That, it seems, was enough.\n\nIt still is.  Join us and be part of the next chapter.\n\n– Jo Parsons – Founder, Turning Point Trust.",
      "picture": "/assets/images/blog-history-pt2.jpg"
    },
    {
      "title": "A Not So Brief History of Turning Point Trust (Part 1)",
      "date": "February 17, 2023",
      "preview": "Jon and I met in 1998 and were married in June 1999. He was working in I.T. and I was a full time...",
      "text": "Jon and I met in 1998 and were married in June 1999. He was working in I.T. and I was a full time youth pastor. One of the things that attracted us was our shared willingness to go overseas, although neither of us imagined it would be in the near future.\n\nOne month after our wedding Jon was diagnosed with Multiple Sclerosis (MS) which is a progressive neurological disease without a cure. After brain scans and lumbar punctures, it was confirmed. In the early stages it is relapsing/remitting so there were times he was completely fine. However, facing it forced us to realise that none of us know what the future holds or how long we have. It made us ask, “what are we living for? What really matters?”\n\nSix months later the company Jon worked for relocated, so he took redundancy. Working in I.T. had satisfied his head but not his heart so he used a few months to explore what else he might do. During this period he did some voluntary work editing videos for a small local charity. I also had links to this charity through my youth work as they were very involved in short-term mission trips, and I referred lots of gap-year students to them. After a while, the charity discovered we were married and that they knew both of us. They asked us to go to Kenya and spend six months out there. Their flagship work was in Kibera, and they were considering moving from short-term mission to longer term work but didn’t want to duplicate what was already happening. We didn’t have kids and it seemed like an adventure, so we said yes! After a month living with Kenyan hosts and taking Kiswahili classes, we started an audit of what was happening in Kibera under certain headings (HIV, vocational training, food and nutrition etc). Our guide was a man named John Kariuki. We’d expected to struggle or perhaps be frightened in Kibera, but it was nothing like that. Instead, we felt an odd sense of “belonging”. Of course, we were so different and so was the life we’d been born into – and yet it felt like our hearts were strangely comfortable being there.\n\nDuring the next five months we covered every area of Kibera – some we perhaps shouldn’t have – one day a lad took us through the “rat runs” and we crossed the river, stepping over a dead man with a knife in his head. We also read a lot to understand the context and got help from a lecturer at the University of Nairobi. We truly got to see the big picture and learned a great deal.\n\nThree days before we had to leave, Kariuki mentioned to us that there were children not being reached by any of the big relief organizations which tended to base themselves around the edges of Kibera, where the roads and phone connections were. We were surprised he hadn’t mentioned this before, but we were wazungu and perhaps he’d been waiting to see our hearts and know whether he could trust us. By this point we had a full report written, finished, and ready to take back to the UK charity. We fitted in a quick visit to Mashimoni and saw that indeed, people in the heart of the slum, already more disadvantaged than those at the edges, were being missed. It touched our hearts and we wrote a proposal for work there, including it in the report. Saying goodbye to Kariuki was harder than we expected. We had both grown to love him and he had been so faithful to us. We’d also met the Pastor of Kariuki’s church at the time, Shadrack Mulinge, and his wife Eunice. All three were actually going through a very difficult situation and we watched them respond in prayer and not in retaliation. They were good people.\n\nReturning to the UK, we went to hand over the report. But at exactly that point, the director of the charity who had commissioned it stepped down due to personal circumstances. The new director was appointed but didn’t read the report, as he had no interest in Kenya and was intending to take things in a different direction. So, there we were, with six months of very current detailed research and knowing all sorts of children were not getting help, but having no outlet for this information. We felt somehow responsible – we had been changed by what we’d seen. We decided to approach some mission organizations who had experience in development work in East Africa. They graciously listened but we hit endless bureaucratic red tape. They didn’t know us, we didn’t know them, and they hadn’t commissioned the report. Some were interested in recruiting us as missionaries but once they knew about Jon’s MS, it was clear that wouldn’t proceed. It was a dead end.\n\nAfter a while we decided to fund a trip back to Kenya and approach some of the organizations we had met whilst there before. This was far more effective, people were interested in any up-to-date research on the slum and heard what we were saying. However, Kenya was still under President Moi at this time, street children had reached epidemic proportions, and every programme was maxed out. There was literally no capacity in terms of funding or people to stretch to any further work. Whilst there we met with a small international NGO who worked nearby in Kibera. They told us they couldn’t take it on, but if we were to come and do it ourselves, they would cover us in terms of shipping, help with work permits, lend us their social workers to help us start. We literally knew nothing about any of this and had not once been considering that it might be us, only thinking that we could send some support from the UK.\n\nThe same week, we met Bishop Daniel Ogutu. He had run Christian educational and vocational work in Mathare for some years and trained Pastor Shadrack. He talked to us and suggested that our heart and ideas for what needed to happen were very similar to what he was doing. “Why don’t you build a team and do it on this side of town?” he said. My NGO can give you the umbrella cover you need to start work like that here in Kenya.\n\nWithin a few days, an indigenous NGO and an international NGO had offered us their advice and support. Both had suggested perhaps we should come. It was astonishing.\nWe prayed about it and felt excitement. It wasn’t so much a compulsion that we must do this, more like God was saying: “If you would like it, there’s an opportunity here. And I’m removing every obstacle in the way.”\n\nJon responded far quicker than I did. We were both excited, daunted, feeling totally unqualified and many other emotions, but for me the cost felt so big. I’d not imagined leaving my home country for good. I had imagined having children and being near my Mum and my sister. Kariuki, Pastor and Eunice were around whilst all this was happening. Their hearts were so much for the children & families who were suffering. And suddenly it became clear. We’d recalled how we’d watched them respond with such integrity to persecution on our previous trip. God had already put a team together for us. There was already relationship and there was mutual trust. We reached a place of peace and wrote a message home to our parents telling them we’d be moving to Kenya. I can only imagine they weren’t very happy about that.\n\nReturning to the UK we were convinced that if we were going to do this unexpected crazy thing then we must do it properly, so that it could stand firm and not fall apart after a year or so. We approached people in churches we were connected with to pray for us. They were all incredibly concerned about Jon’s MS and the wisdom of us doing this, in fact many actively advised us not to. I was late 20’s and Jon 31, we must have seemed idealistic not realistic. Yet inside we both had a conviction that we hadn’t been looking for this, that God was going ahead, and we could trust Him. We wrote to those who had been wedding guests and told them we were giving up our jobs to go to a slum in Africa and please would they consider supporting us financially. I found this painfully difficult, it’s about the most shameful thing you could do in British culture (give up work and ask for money) and risked many relationships. We started the process of registering a UK charity, finding trustees, writing a constitution etc. This was something we’d never done, and we were repeatedly warned how lengthy and difficult it was, often taking years. We submitted it in Nov 2001, and it was approved first time round January 2002. Everyone was amazed. We held a launch party for what had then been named “Turning Point” in Feb 2002. I was newly pregnant with our first child Hannah. It was a fantastic evening, but many Christians around us remained very concerned – they wanted it all to work out but going to an African slum with a new baby and Jon with MS? Was this really wise?\n\n– Jo Parsons – Founder, Turning Point Trust.",
      "picture": "/assets/images/blog-history-pt1.jpg"
    },
    {
      "title": "Let's Prioritize Education",
      "date": "January 27, 2023",
      "preview": "When I was in campus I took a class on Poverty and development and one definition of poverty that...",
      "text": "When I was in campus I took a class on Poverty and development and one definition of poverty that has remained with me is that poverty is the denial of freedom to choose. This is a quote from a UN Statement on poverty signed in 1998 by heads of all UN agencies.\n\nI believe that education within or without the walls of a classroom opens up the choices an individual can access. Building a child’s self-awareness, self-efficacy, creativity, cognitive abilities, social skills and any other competency taught and modeled in an education setting allows the child to be aware of the many choices available to them.\n\nIn the community we work in, I believe one of the choices that education affords the children is the choice that their lives could be different from that of their parents. It’s the awareness that they carry unique value, that’s needed in their families, community and nation and with this awareness they make decisions that safeguard the value they carry.\n\n“Education is the most powerful weapon which you can use to change the world.” These words by Nelson Mandela remain true and I believe that it not only changes their outer world but also their inner world.\n\n– Brenda Kaloki – Programs Coordinator, Turning Point Trust-Kenya.",
      "picture": "/assets/images/blog-prioritise-education.jpg"
    },
    {
      "title": "A Privileged Visit",
      "date": "November 3, 2022",
      "preview": "Having been a Trustee since spring 2021, it was with huge excitement that I travelled to Nairobi to...",
      "text": "Having been a Trustee since spring 2021, it was with huge excitement that I travelled to Nairobi to visit the projects and people of The Turning Point Trust for the first time, as part of a team of 8 from the UK (Directors, Trustees, and friends).\nDuring the week, we had the privilege to visit all three sites (Mashimoni, Laini Saba and Kianda) and to see the incredible work in action. From watching the children develop their computer literacy skills in the IT lab to learning football techniques with Coach Brian, from seeing the joy, nutrition, and empty plates that the feeding programme brings to the excellent resources the library provides to children across the Kibera community – it was just fantastic and gave a real insight into the day-to-day impact.\nIt was abundantly clear the enthusiasm for learning that the children have and how utterly happy they are to be in school, fantastically supported by the dedicated teaching and pastoral staff, who work so hard.\nA particularly powerful part of the trip was the time we spent with Margaret and Daniel, the social workers, visiting homes of the children. It’s hard to articulate just how challenging the conditions are in Kibera and it was a truly humbling experience, reminding me how very fortunate I am to have been born where I was. I was struck by how incredibly welcome we were made to feel by the children’s families, welcoming us strangers in with warm arms, and sharing so openly with us their stories and dreams. The gratitude they have that their children are able to benefit from the love, care and opportunities of The Turning Point Trust was so palpable. It was particularly moving to hear how many of them had recently successfully undertaken the newly launched Parenting Course, equipping them with key skills. For some, it really has been a game changer for the better in their relationship with their children, how amazing is that.\nAfter a whirlwind week, our trip sadly came to an end, and I left Kenya full of emotion and feelings. Huge pride for what The Turning Point Trust does, helping those who need it most. Immense gratitude for all our staff for their dedication, hard work and love that they pour out every day. Sadness and despair that there remains such inequality and poverty in our world. But also, an overwhelming sense of hope, determination, and enthusiasm for what not only I as a Trustee can do to continue to support, but what we can all collectively achieve to hopefully help even more children and families.\nFrom the bottom of my heart, thank you for what you do to support The Turning Point Trust. It is truly making a difference in transforming lives, restoring hope, and allowing these children to reach their God-given potential. We couldn’t do it without you.\n– Lucy Woodcock, Trustee.",
      "picture": "/assets/images/blog-privileged-visit.jpg"
    },
    {
      "title": "Nurturing Young Talent",
      "date": "October 4, 2022",
      "preview": "Tony is now playing in the national youth league with Cheza Sports! And 2 other boys have joined the...",
      "text": "Tony is now playing in the national youth league with Cheza Sports! And 2 other boys have joined the Cheza Sports Academy, one of the top football academies in Kenya!” reported the coach of the Turning Point Football Club (TPFC) during a recent managers’ meeting. There was celebration and awe at this news.\n\nTony was enrolled into the Fountain of Hope school in 2015 at Grade 5, and due to his love for football he joined the TPFC soon after. While at the club, Tony was able to sharpen his skills in football as well as build his character in the field and in general as a young boy.\n\nCoach Brian, who is a great role model and mentor to the boys in the club, supported Tony to avoid negative influence much present in the community and encouraged him to work hard in school as much as he did playing football.\n\nThe club’s main objective is to build character among players, nurture their talent and to promote growth through partnerships with existing football organizations, schools and academies with the aim of seeing the children thrive in the sport. Currently, the club has 51 players in categories under – 12, 13 and 15 year olds.\n\nJuliet, a former TPFC member, did very well in her final primary school exam and because of her passion and skills in football she was able to get full sponsorship into a local girl’s football secondary school in a couple of months.\n\nExtra-curricular activities like football, mentorship, journalism etc. have contributed to the holistic development of the children at the Fountain of Hope School. Many children have developed their passion, skills and talent in different areas and children like Tony and Juliet are on the right path to achieve their full potential.",
      "picture": "/assets/images/blog-nurturing-talent.jpg"
    },
    {
      "title": "Quality Education",
      "date": "August 6, 2022",
      "preview": "Many children in Kibera are left behind in education. Many do not have the opportunity to complete....",
      "text": "Many children in Kibera are left behind in education. Many do not have the opportunity to complete primary school and transition to secondary school.\n\nShelly joined the TP school transition programme at the age of 9, after staying out of school for 2 years. Her mother is a single parent and the sole breadwinner of their family. Shelly is the first child and naturally she is expected to help look after her 2 younger brothers while her mother is out looking for work. This forced Shelly to grow up and take on much responsibility at a young age.\n\nIn the programme, Shelly was older than most of her peers in her class, but this did not stop her from going after her dreams. Through support and mentoring by her teachers, Shelly’s leadership skills were developed. She was then elected by other students to become the school president. This pushed Shelly to continue leading by example and to be the best student she can be.\n\nShelly’s hard work and good character paid off when she passed her final primary school examinations and was awarded full scholarship into a girls’ secondary school. “I didn’t think I would ever finish primary school and join secondary school” said Shelly as she narrated how hard her life was before she joined Turning Point.\n\nThe Fountain of Hope school aims to provide a quality, holistic education that supports the children to thrive and achieve their full God-given potential. This support continues after the children transition to secondary school.The TP secondary school programme supports children to attend secondary schools and vocational training.\n\nWe enable children to gain further education and practical skills they need to start their chosen career. We do this by partnering with likeminded secondary schools and businesses that uphold hard work and good values.We also run retreats and camps during school holidays to catch up with students like Shelly and many others.\n\nOur staff are always present and ready to listen to their triumphs or struggles on academics, careers, psychosocial issues and offer them support. We value maintaining these relationships beyond the primary school. We find joy in knowing that they feel supported even when they are away from us.",
      "picture": "/assets/images/blog-quality-education.jpg"
    },
    {
      "title": "Mentors Make the Difference",
      "date": "April 27, 2022",
      "preview": "“I want to score 300 or more in my end of term exams”, “I want to become a better footballer”....",
      "text": "“I want to score 300 or more in my end of term exams”, “I want to become a better footballer”, “I want to stop using bad language”\n\nThese are a few of the goals our current Transition Class students set at the beginning of the school year with the help of their mentor teachers. The students returned to school after a long time out of school, their mentors supported them as they settled in school.\n\nThe mentors helped the students to problem-solve during their regular check-ins. Belinda was struggling to reach her goal to improve her reading because she did not have time outside of school to practice. Belinda and her mentor decided they would talk to her guardian to reduce the number of chores she had to do after school so that she had time to read.\n\nMichael’s goal was to stop getting into fights and his biggest challenge was when his friends mocked and provoked him. His mentor helped him to think through different ways to respond to his friends without resorting to fighting.\nWith support from their mentors, the students are learning that they can achieve a lot when they set a goal and work towards ",
      "picture": "/assets/images/blog-mentors-difference.png"
    },
    {
      "title": "Power of Choice",
      "date": "April 27, 2022",
      "preview": "“Hosanna! Hiyah! Blessed be your name, hoo-ha!” Our grade 4 and 5 students belted out this...",
      "text": "“Hosanna! Hiyah! Blessed be your name, hoo-ha!”\nOur grade 4 and 5 students belted out this song at full volume while throwing out karate moves in the recent holiday clubs.\n\nIn our first holiday clubs since the pandemic began, we explored the power of choice. Over two weeks, we met with our upper school students and secondary school students. The kids had a ball learning new games and songs while the facilitators took every opportunity to help the children reflect and learn.\n\nThe children we work with are exposed to a lot at a very early age. We aim to help them understand what they see happening around them and make good choices.\n\nThe youngest group of 10–11-year-olds were so open as they shared the things that cause them stress. They mentioned hunger; when family members fight; or when someone they care about gets sick as causes of stress. Together, they brainstormed positive ways to manage stress rather than turning to other negative choices.\n\nThe 12 to 13-year-olds went out to talk to our neighbours about the strengths and challenges in the community. The group reflected on how much they can learn from people in the community. There are many everyday examples of people finding their way through struggles to reach their goals.\n\nThe secondary school students had a chance to fact-check myths they had heard around reproductive health with a doctor. The students are scattered around different secondary schools around the country. The clubs were an opportunity to catch up with old friends. Our team checked in on the students’ school reports and reflected on their goals from previous clubs.\n\nThe common theme through the clubs was the Easter story. Learning that while as humans we all make bad choices sometimes, there is grace and forgiveness and a way to make things right.",
      "picture": "/assets/images/blog-power-of-choice.jpg"
    }
  ],
  "team": [
    {
      "name": "Judy Akoth",
      "designation": "Chief Executive Officer",
      "picture": "/assets/images/our-team-page-1.jpg",
      "alt_pic": "Judy Akoth | Chief Executive Officer",
      "class_style": "team-item team-item1"
    },
    {
      "name": "Eunice Mulinge",
      "designation": "Welfare Overseer",
      "picture": "/assets/images/our-team-page-2.jpg",
      "alt_pic": "Eunice Mulinge | Welfare Overseer",
      "class_style": "team-item team-item2"
    },
    {
      "name": "Brenda Kaloki",
      "designation": "Programme Coordinator",
      "picture": "/assets/images/team3.jpg",
      "alt_pic": "Brenda Kaloki | Programme Coordinator",
      "class_style": "team-item team-item3"
    },
    {
      "name": "Margaret Munyambu",
      "designation": "Center Manager & SSW",
      "picture": "/assets/images/team4.jpg",
      "alt_pic": "Margaret Munyambu | Center Manager & SSW",
      "class_style": "team-item team-item4"
    },
    {
      "name": "Leo Onyango",
      "designation": "ICT Manager",
      "picture": "/assets/images/our-team-page-6.jpg",
      "alt_pic": "Leo Onyango | ICT Manager",
      "class_style": "team-item team-item5"
    },
    {
      "name": "Sharon Karanja",
      "designation": "Administrator",
      "picture": "/assets/images/our-team-page-7.jpg",
      "alt_pic": "Sharon Karanja | Administrator",
      "class_style": "team-item team-item6"
    },
    {
      "name": "Teacher Jennipher",
      "designation": "Head Teacher",
      "picture": "/assets/images/our-team-page-8.jpg",
      "alt_pic": "Teacher Jennipher | Head Teacher",
      "class_style": "team-item team-item7"
    },
    {
      "name": "Pastor David",
      "designation": "Head Teacher",
      "picture": "/assets/images/our-team-page-9.jpg",
      "alt_pic": "Pastor David | Discipline",
      "class_style": "team-item team-item8"
    },
    {
      "name": "Teacher Collins",
      "designation": "Deputy HeadTeacher",
      "picture": "/assets/images/our-team-page-10.jpg",
      "alt_pic": "Teacher Collins | Deputy HeadTeacher",
      "class_style": "team-item team-item9"
    },
    {
      "name": "Jackline",
      "designation": "Finance Officer",
      "picture": "/assets/images/our-team-page-13.jpg",
      "alt_pic": "Jackline | Finance Officer",
      "class_style": "team-item team-item10"
    }
  ]
}
