{
  "preSchool": {
    "theChallenge": {
      "title": "The Challenge",
      "text": "Pre-school builds the foundations for life-long learning and yet 16% of children in Kenya do not attend pre-school. Like five-year-old Evans whose parents live on less than $2 a day in the sprawling informal settlement of Kibera. Evans’ parents are already paying school fees for three older siblings in primary school and cannot afford the fees to send Evans to pre-school as well.When both parents are busy making ends meet, Evans is left with a neighbour. She keeps an eye on him but its easy enough for the inquisitive child to wander off exploring. The risks are numerous to a small child in Kibera. Turning Point’s ECD Programme provides a safe environment for children like Evans to learn and thrive."
    },
    "ourApproach": {
      "title": "Our Approach",
      "text": "We run a free pre-school for children like Evans in Kibera who don’t have the opportunity to attend a pre-school.Our pre-school provides a safe environment for children to play, explore and grow. Each day involves a fun-packed programme of play-based learning, circle games and sports. The kids receive a healthy breakfast and lunch each day and our social workers work closely with families to promote positive parenting at home."
    },
    "ourImpact": {
      "title": "Our Impact",
      "text": "Evans is now in our pre-school learning to count and read. He loves doing puzzles and building houses and cars out of playdough. He makes lots of noise with his friends as they play football on the playground. Evans is gaining the foundational knowledge that will help him to do his best in primary school."
    }
  },
  "schoolTransition": {
    "theChallenge": {
      "title": "The Challenge",
      "text": "About 30%, or three out of 10 students, who enrol for school in Grade one in\nKenya, fail to complete their primary education at Grade 8, signifying the high rate of either\ndropout or repetition of grades. The number is higher in low resourced communities.\nWhen Paul’s mum fell sick, he dropped out of primary school to look after her and his younger\nsiblings. A year passed and his dreams of becoming an engineer faded into the background.\nMany children in Kibera are unable to attend school due to poverty or poverty related problems.\nThese young people join the already huge unskilled workforce competing for unreliable, low-\npaid work and the cycle of poverty continues. Despite primary education being free in Kenya,\nthe additional costs associated with schooling, such as admission fees, feeding programs, and\neven desks, make it difficult for parents to afford. As a result, children can be found playing in\nthe streets, running errands, caring for their siblings, or collecting recyclable items to sell for\npocket money."
    },
    "ourApproach": {
      "title": "Our Approach",
      "text": "The School Transition Programme supports out of school children to return to\nschool and complete their primary education. This includes enrollment into our free primary\nschool with extra support such as student buddies to help them adjust and a mentor teacher to\nprovide academic and social guidance. Additionally, we offer remedial classes to help them\ncatch up on missed learning."
    },
    "ourImpact": {
      "title": "Our Impact",
      "text": "Collins, an orphan and aspiring rapper, impressed Turning Point kids with his\nperformance at the annual holiday camp. With the organization&#39;s help, he now lives with an\nuncle and is catching up on his education through the Transition Class. Despite being 19 and in\nGrade 8, he has shown impressive progress and can now read and write his own raps. He will be\ntaking his final primary school exams this year."
    }
  },
  "foundationOfHope": {
    "theChallenge": {
      "title": "The Challenge",
      "text": "In the few government schools that surround Kibera, a child will share a\nclassroom with 50 to 70 other pupils. In the small non-formal schools run within the slum, a\nchild can share a textbook with 6 other children. Class sizes may be smaller but often the\nteacher is not trained. As a result, many 10-year-olds in Kibera are unable to read at the level of\na 7-year-old. It is also very rare to have opportunities for arts, drama, music or sports and many\ntalents go unnoticed."
    },
    "ourApproach": {
      "title": "Our Approach",
      "text": "The Fountains of Hope School offers quality holistic education that contributes\nto an increased primary school completion rate. The school prioritizes quality education and\nholistic development of each child with classes limited to 25 students, well-equipped\nclassrooms, qualified teachers, school meals and remedial classes that offer individualised\nsupport to help children who are behind to catch up with their learning.\nAlong with the national curriculum, we offer additional classes in discipleship, I.T., sports, and\ncreative arts. Our social workers and pastoral team offer psychosocial support and mentorship\nto children from difficult backgrounds."
    },
    "ourImpact": {
      "title": "Our Impact",
      "text": "Lydia, a 14-year-old at Fountains of Hope School, has parents who are both\naddicted to alcohol. She joined Turning Point through the School Transition Programme and\nnow attends Fountains of Hope Primary School. Her shyness is gradually being replaced by\nconfidence, and she regularly finishes in the top five in her class exam results. The care she\nreceives at Turning Point and the new friendships she has made, make a big difference to Lydia,\nhelping her reach her full potential."
    }
  },
  "communityLibrary": {
    "theChallenge": {
      "title": "The Challenge",
      "text": "Many children in Kibera return from school to a 10 ft by 10 ft one-roomed home\nwith no schoolbooks, no desk to work at, poor lighting and noise and distractions from other\nfamily members. Completing their homework or doing revision in this environment is incredibly\ndifficult. Many of the small schools in Kibera are unable to provide enough textbooks and don’t\nprovide any further reading material. There is no option for children to research a topic that\ninterests them further. There is no opportunity to develop their literacy and imagination by\nsitting down with a storybook."
    },
    "ourApproach": {
      "title": "Our Approach",
      "text": "The Community Library provides a quiet well-lit space and access to learning\nresources to primary school children in Kibera. Children can also get help with their reading,\nrevision and homework. The library aims to support the improvement of literacy and learning\noutcomes in primary school students in Kibera and create a reading culture in the community."
    },
    "ourImpact": {
      "title": "Our Impact",
      "text": "Matasia is 13 years old and in his final year of primary school at a non-formal\nschool in Kibera. He uses the Turning Point Community Library regularly to do homework and\nread stories. He loves the wonder of science and his favourite book, “You are here” by\nChristopher Potter, is all about the history of our universe. Matasia says, “When I am at home, I\nhave a lot of chores to do, and I am often sent by my mum to fetch water or go to the shop.\nAlso, it is very dark in our house, even during the day”. The community library is making a big\ndifference to Matasia who says, “I’m improving my reading skills when I read the storybooks”."
    }
  },
  "schoolSupport": {
    "theChallenge": {
      "title": "The Challenge",
      "text": "The number of children completing primary school and going on to secondary\nschool in Kenya continues to be low. The secondary school transition rate in Kenya is at 75.8%\naccording to the economic survey (2022). The number of students transitioning from primary to\nsecondary school in 2021 was the lowest compared to available statistics, over the last 5 years.\nIn as much as the free tuition and free day secondary education covers tuition and operational\ncosts, there are other important costs necessary to access secondary school education such as\nschool uniform, feeding costs, utilities, salaries for non-teaching staff etc. For low-income\nhouseholds, meeting these additional costs remain a challenge.\nLastly, most students do not get enough preparation for life post-secondary. They are often\nfaced with stress of making a good adjustment and career choices after they complete\nsecondary school. They struggle with putting choices into a longer-term perspective."
    },
    "ourApproach": {
      "title": "Our Approach",
      "text": "The Secondary Education Programme supports students to attend secondary\nschool and post-secondary or tertiary education, enabling them to gain the further education\nand practical skills they need to start their chosen career. The programme provides scholarships\nto attend school, mentorship, life-skills and career counselling. Our aim is to help the students\nnot only graduate from secondary school and/or tertiary school but also become successful\nadults who can support their families and contribute to their communities."
    },
    "ourImpact": {
      "title": "Our Impact",
      "text": "Elijah came to Turning Point at the age of 11 from a rural home, seeking better\nopportunities. Turning Point sent him back to primary school, which he completed in 2010. After\nprimary school, with mentorship from the social workers, Elijah was enrolled to study\nmechanics, completed an internship and secured a job at a private garage in Nairobi. Elijah has\ngrown into a responsible young man who Turning Point is proud to have a relationship with."
    }
  },
  "whereWeWork": {
    "theChallenge": {
      "title": "Working in Kibera",
      "text": "We work in Kibera, a vast slum in Kenya’s capital city, Nairobi and the largest informal\nsettlement in Africa. It is unclear just how many people live in Kibera but estimates range from\n500,000 to 750,000 people living in just 2.25 square kilometres."
    },
    "ourApproach": {
      "title": "Challenges & Potential",
      "text": "Kibera residents live in small one-roomed homes made of mud and iron\nsheets, with limited access to public amenities. Community and NGO-run schools, hospitals, and\nclinics are available. While some homes have electricity, many rely on paraffin lamps. Despite\nthe challenges, Kibera is a lively and vibrant community full of music, work, conversation, and\nplay. Its residents face difficulties with resilience and creativity, making Kibera a place of great\npotential."
    },
    "ourImpact": {
      "title": "Our Impact",
      "text": "We work in Kibera to provide educational and other opportunities for children and\nfamilies facing poverty and systemic barriers. Our mission is to help them achieve their full\npotential by providing support, resources, and a safe environment to learn, grow, and thrive.\nThrough our programmes, we aim to empower individuals and families to build a brighter future\nfor themselves and their community."
    }
  },
  "blog": [
    {
      "id": 1,
      "title": "Restored Hope",
      "date": "March 10, 2023",
      "preview": "I was locked out of my house by my landlord because I had not paid rent for months. I felt hopeless...",
      "text": "I was locked out of my house by my landlord because I had not paid rent for months. I felt hopeless. I had nowhere to go and no food to feed my 8-year-old daughter.<br><br>My neighbour, at that time, told me about a project that was offering porridge to little children every morning. She took me to this project where I met Pastor Shadrack who welcomed us so warmly. I also saw several children with no shoes eating their porridge with so much joy and satisfaction. My daughter was served a cup of porridge.<br><br>I told Pastor about my plight, and he asked me to bring my daughter, Mercy, every morning for porridge. It was not long before Mercy was enrolled into a government primary school by the project. She had new uniform, new shoes. She loved going to school.<br><br>Mercy graduated from the college of fashion and design and is now running her own design shop in Nairobi.<br><br>As for me, I am a beneficiary of the Kinangop Farm project run by Turning Point and a proud owner of a 1 acre piece of land and a decent house.<br><br>I am filled with gratitude because God brought relief to my life and my children through Turning Point. - Mama Nzembi, Parent",
      "picture": "/assets/images/blog-restored-hope.jpg",
      "picture_blog": "/assets/images/blog-full-restored-hope.jpg"
    },
    {
      "id": 2,
      "title": "Turning Point Is Always My Home",
      "date": "February 23, 2023",
      "preview": "I joined Turning Point not long after it was started. I remember Pastor Shadrack visiting homes...",
      "text": "I joined Turning Point not long after it was started. I remember Pastor Shadrack visiting homes, door to door, looking for children who were out of school. Most people in the community would close their doors in his face, because during that time there were stories going round about a certain local preacher accompanied by a white person who would take children from their parents in the name of wanting to support them in school but then the children would never be seen again. Rumours had it that the preacher trafficked the children to countries far from Kenya. Parents from the community were very afraid. They told their children that whenever they see a Mzungu (white person) they should run away. I grew up believing that wazungu (white people) were not very good people.<br><br>So, one day, Pastor Shadrack knocks on our door, with him was Jon Parsons, a mzungu! I have never been that afraid. But there was a way they spoke to my parents, which was very gentle and honest. They told my parents about their project that offered breakfast to children. They went on saying that there was Bible teaching for the children and fun activities. At that time, my 2 younger sisters and I, ages between 3 and 6, had not started school. Despite the rumours and the fears, my parents agreed to let Pastor Shadrack and Jon to enrol us into the project.<br><br>Every morning we would go to the centre, Mama Judy would serve us some warm, sweet porridge and Pastor Shadrack would teach us songs and some memory verses. We would then go back home around 11am. To date, I still remember some of the verses. They have really helped me through different situations in my life.<br><br>I remember our first classroom was a small, cramped and not so well-lit single room. But we enjoyed it regardless. We looked forward to going to the project every single day. It was not long before playtime was extended from 11am-12pm and we couldn’t be happier! We were thrilled! More time in the centre! More time with mama Eunice, mama Judy, babu Kariuki and Pastor Shadrack. More time away from home.<br><br>More and more children joined us at the centre with time. And with the increased number, the small room was expanded to accommodate all of us. Then mama Judy started serving us lunch over and above the cup of porridge. By this time, we were leaving school at 1pm.<br><br>The daily routine of breakfast, Bible teaching, songs, playtime then lunch went on for quite some time. A few parents got tired of waiting for Turning Point’s next move and took their children to “proper” schools. They felt that TP was wasting their children’s time. Many of us stayed on, continuing with the routine, because our parents could not afford to take us to “proper” schools.<br><br>Finally, Turning Point started enrolling us into school. Many pre-schools declined to take me in. They said I was too old for pre-school. And so, Pastor Shadrack talked to a headteacher at a nearby primary school to allow me to join grade 1 at their school. After many days of back and forth between the headteacher and Pastor Shadrack, I was allowed to join grade 2. In the beginning, I did not enjoy school at all, because I had no preliminary education and I had not been to a proper class before. I really struggled to catch up. I can confirm that preliminary education is important as it affects a child’s literacy, numeracy and writing skills even beyond school.<br><br>Thanks to my father who one day promised to buy me a hand video game if I moved from position 90 to 15 in my school assessments. I remember working harder than ever before. Sadly, he passed away before I could show him my results. Before he could buy me the video game.<br><br>We had to go upcountry for his burial and ended up staying there because mum could not support all of us in Nairobi. My elder brother got a chance to continue with his secondary education back in Nairobi and I felt lucky that he asked me to go back with him. My 2 sisters did not get the chance to continue their education.<br><br>So, I rejoined Turning Point and continued with primary education in a government school. I remember Turning Point providing us with full school uniform, a bag and school items. Not forgetting a brand-new pair of shoes! We felt loved and wanted. Every day on our way to school, we would pass by the centre to have breakfast. Mama Judy was always ready with tea and mandazi (doughnut).<br><br>In secondary school, because of my good grades and discipline, I got elected as the school president. What an honour it was! I attribute this success to the Bible teaching and life lessons given to me by Turning Point earlier on.<br><br>My highlight will always be the holiday camps! All of us would come together from different primary schools. There were loads of fun activities. We would have campfires, drama, singing, competitive games, talent shows and nyama choma (roast meat). Oh, and swimming! The last days of camps were always the saddest. We did not want to go back home.<br><br>I also liked how Turning Point offered food to our parents to sustain us during school holidays. Turning Point would engage us during holidays with activities that kept us away from the streets and bad company.<br><br>I am very grateful for where I am today. I owe it all to Turning Point. They got me from a hopeless situation, where life was very difficult with no hope for education and a future. I am a Diploma holder and I would like to one day advance my qualifications to Bachelors level. I  am currently working as a sales coordinator at a company in Nairobi. I also run my own business on the side. My life is so much better now.<br><br>Turning Point will always be my home. Thank you, Turning Point.<br><br>– Boniface Onyango – Turning Point Trust Alumnus.",
      "picture": "/assets/images/blog-turning-point-my-home.jpg",
      "picture_blog": "/assets/images/blog-full-turning-point-my-home.jpg"
    },
    {
      "id": 3,
      "title": "A Not So Brief History of Turning Point Trust (Part 2)",
      "date": "February 20, 2023",
      "preview": "In April 2002 we took a trip to Kenya to meet up with Kariuki, Pastor & Eunice and finalise plans...",
      "text": "In April 2002 we took a trip to Kenya to meet up with Kariuki, Pastor & Eunice and finalise plans. These were pre-mobile phone times, only very poor dial-up email, so it was difficult to communicate with them when we weren’t actually there. Shortly after we landed Jon had a relapse of his MS. It was particularly bad that time. He was numb in one half of his body and couldn’t really walk. One side of his face locked up and he couldn’t smile. He was pretty much confined to the bedroom of our friend’s house. We tried to see a doctor but there is hardly any prevalence of MS in Kenya, so it was virtually unknown. As a result of this, I did all the meetings. Kariuki came to the house. He was shocked when he saw Jon. I had a list of things to talk to him about in a notebook. He asked if he could start with things that he, Pastor and Eunice had thought about whilst they’d been praying. Being senior to me, I naturally deferred to him. As he talked, unaware of my list and our own ideas, he literally covered every single point Jon and I had written down in the UK. The confirmation of God’s leading and the unity of the team was so encouraging and reinforced the peace we already had about coming and doing this, despite how “risky” and “foolish” people in the UK felt it was.<br><br>In August 2002 our firstborn, Hannah, arrived. By now we had sold the house we had just started paying for when we got married and were living with other people. Adapting to a new baby we also packed up our belongings, some things into crates to be shipped, the rest to my parents’ attic. When Hannah was 2 months old, we said the most painful and difficult goodbye to our parents at the airport and got on the plane. On my side of the family Hannah was the first grandchild for almost 30 years. It felt so costly and like I was being so cruel to my family. There were times I told God that He was asking too much. Yet all the way through we’d had such peace.<br><br>We arrived in Nairobi 23rd Oct 2002. Unqualified, naïve, but part of our hearts was already there, and we were trusting in God who knew far more than we did. From that day onwards Jon never once had any MS symptoms. After five years with nothing at all he was totally discharged from the UK consultant doctors that he was under. At the time we went to Kenya, they had said that a hot climate would cause issues for him. In 2007 some new research came out which totally changed the way they thought about this disease, with the discovery of a direct beneficial link to Vitamin D from sunshine. This is why there is so much of this illness in the Northern hemisphere, but virtually none on the equator. But of course, God already knew that.<br><br>At this point, if you go to the website and it probably says “it all started with a pot of porridge”. We did indeed begin with uji, in March 2003 after several months’ prayer and planning. We served it after most children had gone to school, so we knew those that came were those who really needed to benefit. I think Jon and I, Pastor Eunice and Kariuki will never forget that first group of children who came. They got uji, outside games, singing and love. That was about it. We operated from two tiny rooms on the current TP Mashimoni site and within a very short period 60 children were crammed in their daily. We did not own any other rooms and the playground area was a fenced off dumping site. Three weeks after starting, local meddling and opposition closed the whole project down and we ended up being investigated by CID. This was a very intimidating and incredibly anxious time especially for Jon and I as foreigners, but we had nothing to hide. We had determined there was no corruption from day one, because you cannot build God’s work on a rock with cracks in. After investigating they found absolutely nothing and realised the heart of the work was genuine. Whilst the community watched and speculated, we ended up with a letter from the Office of the President on the wall commending the work of Turning Point and giving it full permission to continue. God is bigger than any system, even any corruption and dirty dealings, and He will establish His work if we only trust and wait and don’t try to fix it ourselves by taking short cuts.<br><br>The rest – as they say – is history. But history that is always in our hearts, and history that has so many more stories of His incredible faithfulness. The way we found staff, the farm, the new school building, it’s all impossible that we should have that except for God.<br><br>God in His faithfulness allowed us twelve years in Kenya, a country that often feels more like our home than the UK. In 2014 we passed on the baton and have been so happy to see new directions, partnerships and developments that would not have been possible were we still there. We planned to try and visit as a family in 2020 but with the pandemic it ended up being 2022.<br><br>I can hardly describe the joy of being physically present with many staff that continue with Turning Point to this day, some that we have known since the very first day 03.03.03. For the first time, we were able to finally see the Fountains of Hope school. Looking at this built-for-purpose structure where once we had a few dark rooms and a rubbish dump, was incredible. A full two-storey primary school (age 6-14), registered with the Ministry of Education. A whole I.T. suite which even the youngest classes can access – right there in the heart of Kibera! These days Nairobi is well-renowned as the tech hub of Africa, so this is vital for their working futures. Teachers who have accessed a variety of specialist training and have resources and a huge photocopier. Social workers who understand the very difficult backgrounds many of the pupils come from and can work alongside parents and teachers. Successful sports programmes that not only encourage skill but mentor the children. Discipleship classes that ensure each child knows that regardless of academic attainment, they are loved and of worth in God’s sight, a core part of TPT since the beginning. And at the Kianda and Laini Saba sites, specialist transition classes for children not able or ready to access full education, as well as a library full of books and a safe lit space for homework. UK folk might not appreciate how remarkable that is, but in the heart of Kibera, coming from one room homes without books, lit with kerosene lamps, that is no small thing. None of this is a small thing. For those benefiting, it is literally life changing.<br><br>The work of Turning Point has had different seasons, shapes and forms over the years but everything it is, and everything it will be, in is in God’s hands and by his grace. To Jon and I it seems incredible that twenty years have passed since such humble beginnings. Not one of us who started on day one was “qualified” on paper, but our hearts were for a forgotten community of children & families and we were willing to take God at His word. That, it seems, was enough.<br><br>It still is.  Join us and be part of the next chapter.<br><br>– Jo Parsons – Founder, Turning Point Trust.",
      "picture": "/assets/images/blog-history-pt2.jpg",
      "picture_blog": "/assets/images/blog-full-history-pt2.jpg"
    },
    {
      "id": 4,
      "title": "A Not So Brief History of Turning Point Trust (Part 1)",
      "date": "February 17, 2023",
      "preview": "Jon and I met in 1998 and were married in June 1999. He was working in I.T. and I was a full time...",
      "text": "Jon and I met in 1998 and were married in June 1999. He was working in I.T. and I was a full time youth pastor. One of the things that attracted us was our shared willingness to go overseas, although neither of us imagined it would be in the near future.<br><br>One month after our wedding Jon was diagnosed with Multiple Sclerosis (MS) which is a progressive neurological disease without a cure. After brain scans and lumbar punctures, it was confirmed. In the early stages it is relapsing/remitting so there were times he was completely fine. However, facing it forced us to realise that none of us know what the future holds or how long we have. It made us ask, “what are we living for? What really matters?”<br><br>Six months later the company Jon worked for relocated, so he took redundancy. Working in I.T. had satisfied his head but not his heart so he used a few months to explore what else he might do. During this period he did some voluntary work editing videos for a small local charity. I also had links to this charity through my youth work as they were very involved in short-term mission trips, and I referred lots of gap-year students to them. After a while, the charity discovered we were married and that they knew both of us. They asked us to go to Kenya and spend six months out there. Their flagship work was in Kibera, and they were considering moving from short-term mission to longer term work but didn’t want to duplicate what was already happening. We didn’t have kids and it seemed like an adventure, so we said yes! After a month living with Kenyan hosts and taking Kiswahili classes, we started an audit of what was happening in Kibera under certain headings (HIV, vocational training, food and nutrition etc). Our guide was a man named John Kariuki. We’d expected to struggle or perhaps be frightened in Kibera, but it was nothing like that. Instead, we felt an odd sense of “belonging”. Of course, we were so different and so was the life we’d been born into – and yet it felt like our hearts were strangely comfortable being there.<br><br>During the next five months we covered every area of Kibera – some we perhaps shouldn’t have – one day a lad took us through the “rat runs” and we crossed the river, stepping over a dead man with a knife in his head. We also read a lot to understand the context and got help from a lecturer at the University of Nairobi. We truly got to see the big picture and learned a great deal.<br><br>Three days before we had to leave, Kariuki mentioned to us that there were children not being reached by any of the big relief organizations which tended to base themselves around the edges of Kibera, where the roads and phone connections were. We were surprised he hadn’t mentioned this before, but we were wazungu and perhaps he’d been waiting to see our hearts and know whether he could trust us. By this point we had a full report written, finished, and ready to take back to the UK charity. We fitted in a quick visit to Mashimoni and saw that indeed, people in the heart of the slum, already more disadvantaged than those at the edges, were being missed. It touched our hearts and we wrote a proposal for work there, including it in the report. Saying goodbye to Kariuki was harder than we expected. We had both grown to love him and he had been so faithful to us. We’d also met the Pastor of Kariuki’s church at the time, Shadrack Mulinge, and his wife Eunice. All three were actually going through a very difficult situation and we watched them respond in prayer and not in retaliation. They were good people.<br><br>Returning to the UK, we went to hand over the report. But at exactly that point, the director of the charity who had commissioned it stepped down due to personal circumstances. The new director was appointed but didn’t read the report, as he had no interest in Kenya and was intending to take things in a different direction. So, there we were, with six months of very current detailed research and knowing all sorts of children were not getting help, but having no outlet for this information. We felt somehow responsible – we had been changed by what we’d seen. We decided to approach some mission organizations who had experience in development work in East Africa. They graciously listened but we hit endless bureaucratic red tape. They didn’t know us, we didn’t know them, and they hadn’t commissioned the report. Some were interested in recruiting us as missionaries but once they knew about Jon’s MS, it was clear that wouldn’t proceed. It was a dead end.<br><br>After a while we decided to fund a trip back to Kenya and approach some of the organizations we had met whilst there before. This was far more effective, people were interested in any up-to-date research on the slum and heard what we were saying. However, Kenya was still under President Moi at this time, street children had reached epidemic proportions, and every programme was maxed out. There was literally no capacity in terms of funding or people to stretch to any further work. Whilst there we met with a small international NGO who worked nearby in Kibera. They told us they couldn’t take it on, but if we were to come and do it ourselves, they would cover us in terms of shipping, help with work permits, lend us their social workers to help us start. We literally knew nothing about any of this and had not once been considering that it might be us, only thinking that we could send some support from the UK.<br><br>The same week, we met Bishop Daniel Ogutu. He had run Christian educational and vocational work in Mathare for some years and trained Pastor Shadrack. He talked to us and suggested that our heart and ideas for what needed to happen were very similar to what he was doing. “Why don’t you build a team and do it on this side of town?” he said. My NGO can give you the umbrella cover you need to start work like that here in Kenya.<br><br>Within a few days, an indigenous NGO and an international NGO had offered us their advice and support. Both had suggested perhaps we should come. It was astonishing.<br><br>We prayed about it and felt excitement. It wasn’t so much a compulsion that we must do this, more like God was saying: “If you would like it, there’s an opportunity here. And I’m removing every obstacle in the way.”<br><br>Jon responded far quicker than I did. We were both excited, daunted, feeling totally unqualified and many other emotions, but for me the cost felt so big. I’d not imagined leaving my home country for good. I had imagined having children and being near my Mum and my sister. Kariuki, Pastor and Eunice were around whilst all this was happening. Their hearts were so much for the children & families who were suffering. And suddenly it became clear. We’d recalled how we’d watched them respond with such integrity to persecution on our previous trip. God had already put a team together for us. There was already relationship and there was mutual trust. We reached a place of peace and wrote a message home to our parents telling them we’d be moving to Kenya. I can only imagine they weren’t very happy about that.<br><br>Returning to the UK we were convinced that if we were going to do this unexpected crazy thing then we must do it properly, so that it could stand firm and not fall apart after a year or so. We approached people in churches we were connected with to pray for us. They were all incredibly concerned about Jon’s MS and the wisdom of us doing this, in fact many actively advised us not to. I was late 20’s and Jon 31, we must have seemed idealistic not realistic. Yet inside we both had a conviction that we hadn’t been looking for this, that God was going ahead, and we could trust Him. We wrote to those who had been wedding guests and told them we were giving up our jobs to go to a slum in Africa and please would they consider supporting us financially. I found this painfully difficult, it’s about the most shameful thing you could do in British culture (give up work and ask for money) and risked many relationships. We started the process of registering a UK charity, finding trustees, writing a constitution etc. This was something we’d never done, and we were repeatedly warned how lengthy and difficult it was, often taking years. We submitted it in Nov 2001, and it was approved first time round January 2002. Everyone was amazed. We held a launch party for what had then been named “Turning Point” in Feb 2002. I was newly pregnant with our first child Hannah. It was a fantastic evening, but many Christians around us remained very concerned – they wanted it all to work out but going to an African slum with a new baby and Jon with MS? Was this really wise?<br><br>– Jo Parsons – Founder, Turning Point Trust.",
      "picture": "/assets/images/blog-history-pt1.jpg",
      "picture_blog": "/assets/images/blog-full-history-pt1.jpg"
    },
    {
      "id": 5,
      "title": "Let's Prioritize Education",
      "date": "January 27, 2023",
      "preview": "When I was in campus I took a class on Poverty and development and one definition of poverty that...",
      "text": "When I was in campus I took a class on Poverty and development and one definition of poverty that has remained with me is that poverty is the denial of freedom to choose. This is a quote from a UN Statement on poverty signed in 1998 by heads of all UN agencies.<br><br>I believe that education within or without the walls of a classroom opens up the choices an individual can access. Building a child’s self-awareness, self-efficacy, creativity, cognitive abilities, social skills and any other competency taught and modeled in an education setting allows the child to be aware of the many choices available to them.<br><br>In the community we work in, I believe one of the choices that education affords the children is the choice that their lives could be different from that of their parents. It’s the awareness that they carry unique value, that’s needed in their families, community and nation and with this awareness they make decisions that safeguard the value they carry.<br><br>“Education is the most powerful weapon which you can use to change the world.” These words by Nelson Mandela remain true and I believe that it not only changes their outer world but also their inner world.<br><br>– Brenda Kaloki – Programs Coordinator, Turning Point Trust-Kenya.",
      "picture": "/assets/images/blog-prioritise-education.jpg",
      "picture_blog": "/assets/images/blog-full-prioritise-education.jpg"
    },
    {
      "id": 6,
      "title": "A Privileged Visit",
      "date": "November 3, 2022",
      "preview": "Having been a Trustee since spring 2021, it was with huge excitement that I travelled to Nairobi to...",
      "text": "Having been a Trustee since spring 2021, it was with huge excitement that I travelled to Nairobi to visit the projects and people of The Turning Point Trust for the first time, as part of a team of 8 from the UK (Directors, Trustees, and friends).<br><br>During the week, we had the privilege to visit all three sites (Mashimoni, Laini Saba and Kianda) and to see the incredible work in action. From watching the children develop their computer literacy skills in the IT lab to learning football techniques with Coach Brian, from seeing the joy, nutrition, and empty plates that the feeding programme brings to the excellent resources the library provides to children across the Kibera community – it was just fantastic and gave a real insight into the day-to-day impact.<br><br>It was abundantly clear the enthusiasm for learning that the children have and how utterly happy they are to be in school, fantastically supported by the dedicated teaching and pastoral staff, who work so hard.<br><br>A particularly powerful part of the trip was the time we spent with Margaret and Daniel, the social workers, visiting homes of the children. It’s hard to articulate just how challenging the conditions are in Kibera and it was a truly humbling experience, reminding me how very fortunate I am to have been born where I was. I was struck by how incredibly welcome we were made to feel by the children’s families, welcoming us strangers in with warm arms, and sharing so openly with us their stories and dreams. The gratitude they have that their children are able to benefit from the love, care and opportunities of The Turning Point Trust was so palpable. It was particularly moving to hear how many of them had recently successfully undertaken the newly launched Parenting Course, equipping them with key skills. For some, it really has been a game changer for the better in their relationship with their children, how amazing is that.<br><br>After a whirlwind week, our trip sadly came to an end, and I left Kenya full of emotion and feelings. Huge pride for what The Turning Point Trust does, helping those who need it most. Immense gratitude for all our staff for their dedication, hard work and love that they pour out every day. Sadness and despair that there remains such inequality and poverty in our world. But also, an overwhelming sense of hope, determination, and enthusiasm for what not only I as a Trustee can do to continue to support, but what we can all collectively achieve to hopefully help even more children and families.<br><br>From the bottom of my heart, thank you for what you do to support The Turning Point Trust. It is truly making a difference in transforming lives, restoring hope, and allowing these children to reach their God-given potential. We couldn’t do it without you.<br><br>– Lucy Woodcock, Trustee.",
      "picture": "/assets/images/blog-privileged-visit.jpg",
      "picture_blog": "/assets/images/blog-full-privileged-visit.jpg"
    },
    {
      "id": 7,
      "title": "Nurturing Young Talent",
      "date": "October 4, 2022",
      "preview": "Tony is now playing in the national youth league with Cheza Sports! And 2 other boys have joined the...",
      "text": "Tony is now playing in the national youth league with Cheza Sports! And 2 other boys have joined the Cheza Sports Academy, one of the top football academies in Kenya!” reported the coach of the Turning Point Football Club (TPFC) during a recent managers’ meeting. There was celebration and awe at this news.<br><br>Tony was enrolled into the Fountain of Hope school in 2015 at Grade 5, and due to his love for football he joined the TPFC soon after. While at the club, Tony was able to sharpen his skills in football as well as build his character in the field and in general as a young boy.<br><br>Coach Brian, who is a great role model and mentor to the boys in the club, supported Tony to avoid negative influence much present in the community and encouraged him to work hard in school as much as he did playing football.<br><br>The club’s main objective is to build character among players, nurture their talent and to promote growth through partnerships with existing football organizations, schools and academies with the aim of seeing the children thrive in the sport. Currently, the club has 51 players in categories under – 12, 13 and 15 year olds.<br><br>Juliet, a former TPFC member, did very well in her final primary school exam and because of her passion and skills in football she was able to get full sponsorship into a local girl’s football secondary school in a couple of months.<br><br>Extra-curricular activities like football, mentorship, journalism etc. have contributed to the holistic development of the children at the Fountain of Hope School. Many children have developed their passion, skills and talent in different areas and children like Tony and Juliet are on the right path to achieve their full potential.",
      "picture": "/assets/images/blog-nurturing-talent.jpg",
      "picture_blog": "/assets/images/blog-full-nurturing-talent.jpg"
    },
    {
      "id": 8,
      "title": "Quality Education",
      "date": "August 6, 2022",
      "preview": "Many children in Kibera are left behind in education. Many do not have the opportunity to complete....",
      "text": "Many children in Kibera are left behind in education. Many do not have the opportunity to complete primary school and transition to secondary school.<br><br>Shelly joined the TP school transition programme at the age of 9, after staying out of school for 2 years. Her mother is a single parent and the sole breadwinner of their family. Shelly is the first child and naturally she is expected to help look after her 2 younger brothers while her mother is out looking for work. This forced Shelly to grow up and take on much responsibility at a young age.<br><br>In the programme, Shelly was older than most of her peers in her class, but this did not stop her from going after her dreams. Through support and mentoring by her teachers, Shelly’s leadership skills were developed. She was then elected by other students to become the school president. This pushed Shelly to continue leading by example and to be the best student she can be.<br><br>Shelly’s hard work and good character paid off when she passed her final primary school examinations and was awarded full scholarship into a girls’ secondary school. “I didn’t think I would ever finish primary school and join secondary school” said Shelly as she narrated how hard her life was before she joined Turning Point.<br><br>The Fountain of Hope school aims to provide a quality, holistic education that supports the children to thrive and achieve their full God-given potential. This support continues after the children transition to secondary school.The TP secondary school programme supports children to attend secondary schools and vocational training.<br><br>We enable children to gain further education and practical skills they need to start their chosen career. We do this by partnering with likeminded secondary schools and businesses that uphold hard work and good values.We also run retreats and camps during school holidays to catch up with students like Shelly and many others.<br><br>Our staff are always present and ready to listen to their triumphs or struggles on academics, careers, psychosocial issues and offer them support. We value maintaining these relationships beyond the primary school. We find joy in knowing that they feel supported even when they are away from us.",
      "picture": "/assets/images/blog-quality-education.jpg",
      "picture_blog": "/assets/images/blog-full-quality-education.jpg"
    },
    {
      "id": 9,
      "title": "Mentors Make the Difference",
      "date": "April 27, 2022",
      "preview": "“I want to score 300 or more in my end of term exams”, “I want to become a better footballer”....",
      "text": "“I want to score 300 or more in my end of term exams”, <br><br> “I want to become a better footballer”, <br><br>“I want to stop using bad language”<br><br>These are a few of the goals our current Transition Class students set at the beginning of the school year with the help of their mentor teachers. The students returned to school after a long time out of school, their mentors supported them as they settled in school.<br><br>The mentors helped the students to problem-solve during their regular check-ins. Belinda was struggling to reach her goal to improve her reading because she did not have time outside of school to practice. Belinda and her mentor decided they would talk to her guardian to reduce the number of chores she had to do after school so that she had time to read.<br><br>Michael’s goal was to stop getting into fights and his biggest challenge was when his friends mocked and provoked him. His mentor helped him to think through different ways to respond to his friends without resorting to fighting.<br><br>With support from their mentors, the students are learning that they can achieve a lot when they set a goal and work towards it.",
      "picture": "/assets/images/blog-mentors-difference.png",
      "picture_blog": "/assets/images/blog-full-mentors-difference.png"
    },
    {
      "id": 10,
      "title": "Power of Choice",
      "date": "April 27, 2022",
      "preview": "“Hosanna! Hiyah! Blessed be your name, hoo-ha!” Our grade 4 and 5 students belted out this...",
      "text": "“Hosanna! Hiyah! Blessed be your name, hoo-ha!”<br><br>Our grade 4 and 5 students belted out this song at full volume while throwing out karate moves in the recent holiday clubs.<br><br>In our first holiday clubs since the pandemic began, we explored the power of choice. Over two weeks, we met with our upper school students and secondary school students. The kids had a ball learning new games and songs while the facilitators took every opportunity to help the children reflect and learn.<br><br>The children we work with are exposed to a lot at a very early age. We aim to help them understand what they see happening around them and make good choices.<br><br>The youngest group of 10–11-year-olds were so open as they shared the things that cause them stress. They mentioned hunger; when family members fight; or when someone they care about gets sick as causes of stress. Together, they brainstormed positive ways to manage stress rather than turning to other negative choices.<br><br>The 12 to 13-year-olds went out to talk to our neighbours about the strengths and challenges in the community. The group reflected on how much they can learn from people in the community. There are many everyday examples of people finding their way through struggles to reach their goals.<br><br>The secondary school students had a chance to fact-check myths they had heard around reproductive health with a doctor. The students are scattered around different secondary schools around the country. The clubs were an opportunity to catch up with old friends. Our team checked in on the students’ school reports and reflected on their goals from previous clubs.<br><br>The common theme through the clubs was the Easter story. Learning that while as humans we all make bad choices sometimes, there is grace and forgiveness and a way to make things right.",
      "picture": "/assets/images/blog-power-of-choice.jpg",
      "picture_blog": "/assets/images/blog-full-power-of-choice.jpg"
    },
    {
      "id": 11,
      "title": "Learning for the Future",
      "date": "January 11, 2022",
      "preview": "Have you ever been amazed and perhaps slightly worried by how quickly a child in your...",
      "text": "Have you ever been amazed and perhaps slightly worried by how quickly a child in your life has picked up technology? A toddler who knows how to swipe through photos or a pre-schooler who finds their way to youtube on your phone? Yep, we know the feeling! Fountains of Hope students started using their new computer lab in October. Already, they are not just typing and researching, they are coding.<br><br>Kenya is a hub for tech developments in Africa, so many start-ups are innovating new tech solutions and creating new job opportunities. We hope that an early introduction to I.T. will equip our students for future jobs in tech.<br><br>Lara, in Class 5, said, “it is important to learn computers because then you can do what you want. You can be an accountant or a shopkeeper or any other thing.”<br><br>Lara’s group are getting to grips with a coding game where the players use code to advance their character through the game.<br><br>Teacher Kelvin brought his Class 5 students to the lab to research a recycling project. The students googled ideas for ornaments they could make out of waste materials before making various recycled creations.<br><br>At the recent ReimaginED Summit in Nairobi, we met innovators reimagining education in Kenya. One of the hosts summarised a common theme at the event when she urged, “we need to prepare children for a future we know not.”<br><br>We cannot predict what the future will look like, we can prepare children for whatever the future holds by building their resilience and creativity. And by equipping them with skills to take the lead in developing new technology that will help solve the challenges of tomorrow.",
      "picture": "/assets/images/blog-learning-for-the-future.png",
      "picture_blog": "/assets/images/blog-full-learning-for-the-future.png"
    },
    {
      "id": 12,
      "title": "Growing Partnerships With Parents",
      "date": "January 11, 2022",
      "preview": "A few months ago, I sat in our social workers’ office listening to stories about the children...",
      "text": "A few months ago, I sat in our social workers’ office listening to stories about the children we serve. Stories about what these children go through at home. I remembered our teachers also sharing their struggles to involve parents in the school. Together, we started questioning – how might we bridge the gap between school and home for our children, families and teachers? How might we get to know the children and families better? How might we help parents support their children’s learning? We knew that visiting homes would be a great start to deepen this partnership.<br><br>A week later, a group of staff led by the social workers, started visiting the families we serve. This activity has become a weekly priority ever since.<br><br><br><br>We break out into two smaller groups to cover more ground and to be able to fit into the one-roomed homes.<br><br>The families welcome us with so much warmth and respect. In some cases, we meet parents and guardians who don’t have jobs or are housebound by illness. We also meet our student’s siblings, some are out of school.<br><br>We spend time together and the parents open up, telling us their stories. Stories of love, joy and gratefulness; stories of pain; stories of fears and frustrations. We laugh and cry together. We encourage each other and pray together.<br><br>It is amazing how much we have learned so far. Lessons that have helped us improve our programmes. The task of teaching and supporting our children has come alive. We are now able to attach each story to each respective child. Parents feel more connected to us and our work.<br><br>I have seen great teamwork and compassion towards these families from our staff, going out of their way to find solutions to some of the families’ problems. Prayer groups have formed; follow up mechanisms have been developed to ensure we support our children and their families in the best way possible.<br><br>Our staff have worked together to help the children through counselling and mentoring. They have raised funds for food, school uniform, hospital visits, and travel expenses to reunite children with their families. They have also connected parents with job openings and government services.<br><br>Our hearts overflow with emotions every time we walk away from these homes. It is draining, but we believe that we are engaged in an important component of our work. We are seeing hope and faith restored in these families. This keeps us going every Thursday and we will never look back.",
      "picture": "/assets/images/blog-growing-partnerships-with-parents.png",
      "picture_blog": "/assets/images/blog-full-growing-partnerships-with-parents.png"
    },
    {
      "id": 13,
      "title": "A New Way of Working",
      "date": "July 30, 2021",
      "preview": "Beatrice had been out of school for two terms and was nervous about going back to school, she...",
      "text": "Beatrice had been out of school for two terms and was nervous about going back to school, she didn’t know any of the other kids at the school. Would she make friends?<br><br>Jeff was looking forward to being a student again, wearing the uniform, walking to school with the other kids but he was not looking forward to meeting the teachers. He was sure he would get into trouble a lot, he always did at his old school and the punishments were harsh.<br><br>On Makau’s first day back in school he looked for a seat right at the back of the class, he did not want to be picked to read, he would rather do anything than be called to read in front of the class.<br><br>Returning to school after a long time can be a nerve-racking experience. Our School Transition Programme aims to make the journey back to school a smooth one. Over the past few months, we have been listening to children who have gone through the Transition Programme and their teachers to understand what is working well and what needs to improve. We’ve also been learning new skills from other organisations.<br><br>As a team, we’ve developed a new design for our Transition Programme and we’re rolling it out this new school year. The main change is that instead of the Transition Programme students learning in a separate centre, they will join the Fountains of Hope School directly while getting extra support to settle in.<br><br>When Beatrice joins the Fountains of Hope School she will be paired up with a student buddy, a student who has been in the school for a while who can show her around and introduce her to some new friends.<br><br>Jeff will meet regularly with a mentor teacher who will help him to set goals for the term and work towards those goals. Jeff’s mentor will be a safe person he can talk to, together they can get to the bottom of why Jeff tends to get into trouble and what changes he can make to see an improvement.<br><br>Makau will have extra classes before or after school to help him catch up on his foundational reading, writing and maths skills as well as extra help on any subject he’s fallen behind in. The teachers will help him to grow confident in reading.<br><br>Would you like to support the group of 20 new children joining the Transition Programme this month? You can give online using this link: Support a Child Returning to School.",
      "picture": "/assets/images/blog-new-way-of-working.png",
      "picture_blog": "/assets/images/blog-full-new-way-of-working.png"
    },
    {
      "id": 14,
      "title": "Home in Kibera",
      "date": "July 8, 2021",
      "preview": "We walked through the streets of Kibera and made many stops at the various homes. “Hello, where is Mama Mimo?”...",
      "text": "We walked through the streets of Kibera and made many stops at the various homes. “Hello, where is Mama Mimo?” we asked a vendor next to Mama Mimo’s vegetable shop. The vendor directed us to where we would find her. It was a hot sunny day and Mama Mimo was seated under an umbrella behind her shop. The moment she saw us, her face lit up in a smile. We could tell she was happy to see us.<br><br>We then took a short walk to her house, where she welcomed us warmly and set each one of us a glass of drinking water. The condition of her home had improved compared to the last visit we had in 2019. Mama Mimo couldn’t hold back her excitement and began telling us how much Turning Point has helped her daughters, Mimo and Njeri, in school. She also went ahead to add that her business of selling vegetables is doing well. She could not stop mentioning how grateful she was.<br><br>In all homes, we sat and talked to the parents and guardians and listened to them as they shared about their victories and struggles. Not all homes had improved conditions. Some were stagnant, while others were struggling to get a meal in a day. As they spoke to us, we would identify how positive and hopeful they were. As we ended our visit with Mama Mimo, she said, “We always live each day worrying about the next, but God is the one who provides. So why worry when He is our Sole Provider?”<br><br>Once a year, we accompany our social workers to visit the home of every child we support. When Covid-19 struck the country last year, we had to close down all our programs, hence not being able to do the annual Home Study activity. This year we managed to visit the homes and have a chance to catch up on how the families are doing. Visiting these homes always leaves us with a lesson each time. Even if they live in difficult conditions, they still have a positive mindset and a strong faith in believing that God will always provide, no matter what.",
      "picture": "/assets/images/blog-home-in-kibera.jpg",
      "picture_blog": "/assets/images/blog-full-home-in-kibera.jpg"
    },
    {
      "id": 15,
      "title": "Secondary School Retreat",
      "date": "June 17, 2021",
      "preview": "In March, we hosted 50 students we support in high school in a 3-day retreat. On the first day...",
      "text": "In March, we hosted 50 students we support in high school in a 3-day retreat. On the first day, the students came full of anticipation for what we had in store. All smiles, they greeted each other with fist bumps and high fives as they resisted the urge to hug one another in excitement. It was an opportunity for the students to take a break from their busy school life, take a step back and look at where they are now and where they want to be in the future.<br><br>Each of the three days had a different speaker. On day one, they tackled the theme of Knowing Your Self Identity. Day two’s theme was relationships. Denzel, a form 3 student said, “Honestly speaking, boy-girl relationships are expensive and I don’t earn money to buy a girl gifts every now and then. I only have the pocket money my parents give me.” The rest of the students burst out laughing and applauded him saying, “it is true!” This subject sparked many animated discussions amongst the students.<br><br>Goal setting is an important skill that students need to practice, so on day three, the speaker led the students in the process of setting their goals, outlining the steps to reach their goals and guided them in how to improve and strengthen their skills in general.<br><br>Over the three days, we shared meals, stories and took part in activities that saw the students come out of their shells and bond together. One game that turned out to be a favourite was charades. Before the first round of charades, Zeddy, a form one student said with a smirk on her face, “I think girls are far more intelligent than boys!” This set a winning attitude in each one of them, especially the boys who then had to prove to the girls that they were just as smart! It was beautiful to see them smiling and laughing and leaving the retreat as changed and hopeful students looking forward to what the future has in store.",
      "picture": "/assets/images/blog-secondary-retreat.jpg",
      "picture_blog": "/assets/images/blog-full-secondary-retreat.jpg"
    },
    {
      "id": 16,
      "title": "Catching Up In Reading",
      "date": "June 15, 2021",
      "preview": "“Teacher, Teacher!” the children call out as they strain to raise their hand higher than the...",
      "text": "“Teacher, Teacher!” the children call out as they strain to raise their hand higher than the other kids. Finally, Robai is chosen to answer.<br><br>“School!” she says, and the word is duly scribed on the board. Now the children call out words related to this first word and a spider-like mind map slowly fills the board. Once all the children have contributed a word to the map, they settle down to write sentences using words in the mind map.<br><br>This is one of the games that the Community Library team are using to help children catch up in reading and writing. In Kenya, 60% of children aged 7 to 13 cannot answer a reading and maths test aimed at a 7-year-old. Learning outcomes are particularly low in semi-arid areas of the country and urban slums like Kibera. For this reason, ZiziAfrique developed the Accelerated Learning Programme designed to help children in Grade 3 to 5 to catch up in literacy and numeracy. They trained our team in this approach last year as we reported in the January Viewpoint. Now, 16 children aged 9 and 10 years old are meeting every Monday morning to take part in the Accelerated Learning Programme run by the Community Library team.<br><br>We are running the programme for a group of Grade 4 students who are currently out of school due to the phased reopening of schools in Kenya. So far, the children are enjoying the sessions and we are tracking their progress. We have further plans to repeat the programme with another group of children in the library later in the year and incorporate the approach in our School Transition Programme.",
      "picture": "/assets/images/blog-catching-up-reading.png",
      "picture_blog": "/assets/images/blog-full-catching-up-reading.png"
    },
    {
      "id": 17,
      "title": "Accelerating Learning",
      "date": " December 16, 2020",
      "preview": "The Class 4 students were bouncing with excitement waiting for Teacher Esther to call out the next...",
      "text": "The Class 4 students were bouncing with excitement waiting for Teacher Esther to call out the next item. “A red book!” she calls, and the children turn running, leaping down from the playground to search for a red book. A few minutes later, the winning child skidded to a halt on the dusty playground shouting ‘bingo!’ holding a red book high in the air.<br><br>Teacher Esther was trying out one of the new games she learnt in our latest team training in Accelerated Learning. ZiziAfrique developed the Accelerated Learning Programme for children who have fallen behind in reading and maths. They armed our teachers with new games and activities to keep the children engaged and learning.<br><br>Reflecting on the training, Teacher Esther shared how different concepts build upon each other, like climbing a ladder. Through the training, she gained new tools for assessing where children are on that ladder. The ZiziAfrique team showed us how we can use simple items like sticks, stones and chalk grids drawn on the floor to teach.<br><br>We work with children who have been out of school for a long time, some have been out of school for years. Catching up in reading and maths is the starting point for catching up in all other subjects. We’re excited to start using our new learning as we open the school and transition programme in January.",
      "picture": "/assets/images/blog-accelerating-learning.jpg",
      "picture_blog": "/assets/images/blog-full-accelerating-learning.jpg"
    },
    {
      "id": 18,
      "title": "Art from the Heart",
      "date": "October 28, 2020",
      "preview": "As the pandemic continues to affect many in the world, the number of children who are likely to...",
      "text": "As the pandemic continues to affect many in the world, the number of children who are likely to experience loss and trauma is increasing. With schools closed across Kenya, more children are subjected to child labour, early marriages, child pregnancies, abuse and domestic violence.<br><br>Schools are starting to reopen and bearing in mind how difficult these past few months have been, we want to be ready to address any psychological trauma or emotional distress among our students and staff caused by the pandemic. We want to ensure that the staff members are able to overcome their challenges and perform at their best. We also want our students to come back to a safe space that allows them to continue developing holistically.<br><br>In September, staff members underwent online training to equip them to improve mental health and trauma support for children and adolescents. The training was run by art therapists from The Red Pencil Humanitarian Mission. The training equipped the staff members to use art therapy tools and techniques to support their students’ mental health as they also take care of their own mental health.<br><br>Our Transition Programme Teacher noted that “as a teacher, I have learnt practical ways to use art to help students communicate their emotions. I can create a safe space for children to express themselves and thrive.” Our Children’s Pastor reflected on the benefit to our frontline staff team, saying, “the training has shed more light about self-care and how to self-regulate. In taking care of ourselves, we won’t be fatigued through our work with the new tools in our counselling sessions.”<br><br>The use of art therapy is a unique experience for our team because even though we often engage our students in art activities, we have not used it to intentionally create an environment that supports the wellbeing of children and staff.<br><br>“The use of art will be useful during our mentorship sessions as it will help the shy students open up more about their problems.” Football coach.<br><br>The days have been filled with a lot of learning and self-reflection through art activities. Here are some of the reflections from the staff members:-<br><br>“By understanding how trauma affects children differently we can create a safe space” Children’s Welfare Officer<br><br>“In our transition programme, the lessons on how to assist students to self-regulate will enable the teachers to help the students settle in and make their transition to school easier.” Kianda Centre Manager<br><br>“The training has included staff members from different departments and this will enable TP to support our students more effectively as a team.”<br><br>The Red Pencil Humanitarian Mission believes that “When we rescue the child, we save the adult” and by helping our children develop better coping skills, heal from loss and trauma and grow, we ensure that we give them more opportunities to fully develop their God-given potential.",
      "picture": "/assets/images/blog-art-from-heart.jpg",
      "picture_blog": "/assets/images/blog-full-art-from-heart.jpg"
    },
    {
      "id": 19,
      "title": "Food Vouchers - The How and Why",
      "date": "August 10, 2020",
      "preview": "“I miss the food I normally get at school, some days we don’t have enough food in the house”...",
      "text": "“I miss the food I normally get at school, some days we don’t have enough food in the house” reports 10-year-old Alex, a student from the Fountains of Hope School.<br><br>Before schools were closed, we provided daily breakfast and lunch to over 170 children in our programmes. These children represent 150 families in Kibera. Since coronavirus reached Kenya, many of these families have lost their sources of income. Many of them dropped down to eating just one meal a day to stretch out the little that they have.<br><br>This is why we are providing weekly food vouchers to the hardest-hit families.<br><br>How does the voucher scheme work?<br><br>Firstly, we identify which families are most in need. There are still a handful of families who have managed to keep their jobs while others are sustaining their small-businesses despite the present challenges. We survey the families every two weeks and add to the list of those who need the vouchers. This list has grown from just 30 families in the first few weeks to over 130 as the ongoing challenges take their toll on more and more families. To date, we have distributed 1733 food vouchers in total.<br><br>Why vouchers? Why not food packages?<br><br>The current situation is a strange one. On the one hand, there are families in Kibera who were incredibly vulnerable before the pandemic hit. They were already living on the edge of getting by and the pandemic and its economic impacts have pushed them over the edge. These people need help. On the other hand, there are people in Kibera who, before the pandemic, were running strong businesses. These businesses are struggling now as fewer people in Kibera have money to spend in their shops, but the businesses are still needed and are working hard to stay open. We distribute our vouchers through local shops in Kibera. The families can visit their local shop and collect what they need while the shopkeeper benefits from their business.<br><br>If we were to give out packages of food, this would have a detrimental effect on small businesses in Kibera. Shopping vouchers also give families a bit more flexibility to buy what they need each week rather than a prescribed package of food.<br><br>We are so grateful to all who are supporting us to provide these much-needed food vouchers to some of the most vulnerable families in Kibera. We aim to continue the programme until schools reopen in January. If you would like to donate towards this ongoing programme, visit: https://goto.gg/46252",
      "picture": "/assets/images/blog-food-vouchers.jpg",
      "picture_blog": "/assets/images/blog-full-food-vouchers.jpg"
    },
    {
      "id": 20,
      "title": "Out of School Again",
      "date": "July 8, 2020",
      "preview": "All of the children in Turning Point’s programmes have spent time out of school in the past when...",
      "text": "All of the children in Turning Point’s programmes have spent time out of school in the past when their parents could not afford the fees. With schools closed, they find themselves at home again. We asked them how they’re getting on…<br><br>9-year-old Mercy joined our School Transition Programme in January this year, she was busy catching up on grade 4 work excited to go back to school. But now she finds herself out of school again. Mercy has kept busy at home reading the revision workbook her teachers provided when schools closed. She also has lots to do around the house, babysitting her younger siblings: washing dishes and cleaning the house.<br><br>“One thing I am enjoying about being out of school is having time to play with my friends at home but I miss my friends from school.” Mercy hasn’t seen her school friends for three months now. Her biggest prayer request is for schools to reopen.<br><br>Alex is 10-years-old and in grade 4 at the Fountains of Hope School. He spends most of his days just wandering around Kibera, he does a little bit of reading at home. He is bored and fed up with the situation. His family are struggling to provide enough food at home and he misses the school meals he normally has at school. He also really misses his school friends. His prayer request is that his parents could find work, prayers for his safety and prayers that schools would reopen soon.<br><br>Selina is 10-years-old and in grade 2 at the Fountains of Hope School. She’s spending her time out of school playing at home and helping with household chores. Selina is continuing to learn at home by watching educational cartoons.<br><br>“I am enjoying spending more time with my parents at home,” Selina says. However, as a family, they are struggling and often only eat one meal a day. Selina’s prayer is for protection and for schools to reopen soon.<br><br> <br><br>Enjoy this blog? Subscribe to get the latest news, articles and impact stories from Turning Point.",
      "picture": "/assets/images/blog-out-of-school-again.jpg",
      "picture_blog": "/assets/images/blog-full-out-of-school-again.jpg"
    },
    {
      "id": 21,
      "title": "Spread the Word Not the Virus",
      "date": "June 23, 2020",
      "preview": "he coronavirus being a completely new disease, we’ve all had to learn about the sickness...",
      "text": "The coronavirus being a completely new disease, we’ve all had to learn about the sickness itself, how it spreads and how to keep ourselves safe. Many of us have google at our fingertips or receive public health messages through our TVs and radios. In Kibera, this is more of a challenge. One of our first responses to coronavirus was to start printing posters about the virus from trusted sources – the Centre for Disease Control and the Kenyan Ministry of Health – to put up around Kibera.<br><br>At first, we struggled to find the information in Kiswahili until a local organisation, Shujaaz Inc, developed their own posters in sheng, a kind of slang spoken in Nairobi, which has been so useful to share with the children in our programmes.<br><br>When our staff went out to set up handwashing stations and distribute posters in the first few days after the first case was reported in Kenya, they were jumped on by the area chief. He asked to use the posters to talk to people coming out of prayers at the local mosque. He drew quite a crowd and used the posters to share information on how to stop the spread. Clearly, the crowd was not a great example of social distancing but he had to start somewhere!<br><br>More recently, when our team were out refilling soap at our handwashing stations, one plot of households invited the team to come and explain more about coronavirus. In Kibera, one-room homes are often gathered into plots where rows of homes share a small entryway and some amenities like a long-drop toilet. The small group of families that lived in this plot had already set up a shared handwashing station and wanted to know more about how to protect themselves. Our team took time to talk through the steps they can take and to encourage them that they are already doing a great job with their handwashing station.<br><br>It’s great to see this thoughtful group of families doing what they can to stay safe. We celebrate the area chief working hard to spread good information in his community. We celebrate countless other community groups and individuals who are doing their bit in Kibera to minimise the spread of coronavirus.",
      "picture": "/assets/images/blog-spread-the-word.jpeg",
      "picture_blog": "/assets/images/blog-full-spread-the-word.jpeg"
    },
    {
      "id": 22,
      "title": "Back to school",
      "date": "June 23, 2020",
      "preview": "Turning Point has been returning out-of-school children to school in Kibera since 2004. Our School...",
      "text": "Turning Point has been returning out-of-school children to school in Kibera since 2004. Our School Transition Programme is a one-year programme that helps children to catch up on what they’ve missed so they can integrate back into the school system. The children we serve are out of school due to poverty, not forced to stay home by a global pandemic. Coronavirus school closures may only last a few months while some of the children we work with have been out of school for years. We’ve been working with kids on the margins, kids who slipped through the gaps. But now across the world, we find 9 out of 10 school kids are not in school. Out of school is the new norm, at least for a time. As more countries start to reopen schools or make plans to do so, perhaps we have something to share from the years we’ve spent returning children to school. We thought we would pull together some of the lessons we’ve learned from working with out-of-school kids over the last 17 years…<br><br>1) Understand each child’s experience<br><br>What children are experiencing at home varies widely. Some have detailed timetables with zoom lessons. Some homes are full of educational toys and arts and crafts materials. Some kids have their own room to study in. At the other end of the spectrum, there are kids who have no books at home. There are kids whose parents can’t read. There are kids who don’t have internet access or a laptop, smartphone, tv or even a radio. There are school staff teams who phone up their students every week or even every day to check up on their welfare. There are some students who feel forgotten about. Some schools are finding ways to make sure kids who rely on their school meals get a hot meal or a packed lunch each day at home. There are a lot of kids going hungry.<br><br>While many kids will do just fine during school closures, some will even thrive. Others will have had a really challenging time, some will have lost loved ones or experienced other trauma. Some will have fallen far behind academically. We need to prioritise taking time to listen and understand each child’s out-of-school experience to be able to help each child be ready to get back into school.<br><br>2) It’s not just about academics<br><br>When Peter first joined the School Transition Progamme, he barely talked. He was extremely shy and kept to himself. Each day, our project staff slowly encouraged Peter to take part in circle games like nimetpoteza mbuzi. One child enters the centre of the circle and chants, “Nimepoteza mbuzi!” “I’ve lost my goat!”, all the kids reply “wapi?” “where?”. The child eventually selects another child, points at them and shouts “here!”, now it’s their turn to enter the circle and continue the game. This game probably terrified Peter at first but by the end of the first term, he was joining in and singing as loud as the rest.<br><br>We see children take an amazing journey during the year they spend in our transition programme. Learning to play with other kids, take turns, interact with adults are just a few of the key social skills that children pick up over the year. How will children be doing after the coronavirus school closures? We need to be ready to support children as they readjust to the school environment and catch up on some of those key social skills they’ve missed out on using at home.<br><br>2) Class set-up matters<br><br>We’ve seen that how many students are in a classroom and how children are grouped within a class makes a difference. Normally in school, children are put in classes according to their age. But the children we serve have all dropped out of school at different stages, the quality of the schools they attended varies and each child has been out of school for different lengths of time. Some have been out of school for as long as four years. Age is, therefore, a poor indicator of their academic ability. We, therefore, group children by ability rather than age. After the school closures, how will kids who fell further behind be given extra help to catch up?<br><br>We also make it a priority in our programme to keep the teacher: pupil ratio super low so each child gets the individual attention they need. The return to school may need to be phased to ensure social distancing. Will this provide an opportunity to reduce the teacher: pupil ratios in some settings where classrooms have been overcrowded, at least for a time?<br><br>3) Creativity keeps them captivated<br><br>When Meshak was out of school he would roam the streets, begging for money and use any money he got to buy snacks and play video games in small shacks in Kibera. He was free to do what he wanted, there was no adult following-up on him. When he joined our programme, sitting in class and engaging in lessons was a real challenge for Meshak.<br><br>There will be plenty of children who have experienced similar freedom while out of school during the pandemic. When kids have been out of the school routine for a while, it takes time for them to settle into a timetable and concentrate on an activity. This points to the importance of maintaining some form of routine with your children when they are out of school, as recommended by KICD and other actors. An out of school routine will help ease the transition back to school.",
      "picture": "/assets/images/blog-back-to-school.jpg",
      "picture_blog": "/assets/images/blog-full-back-to-school.jpg"
    }
  ],
  "team": [
    {
      "name": "Judy Akoth",
      "designation": "Chief Executive Officer",
      "picture": "/assets/images/our-team-page-12.jpg",
      "alt_pic": "Judy Akoth | Chief Executive Officer",
      "class_style": "team-item team-item1"
    },
    {
      "name": "Brenda Kaloki",
      "designation": "Programme Coordinator",
      "picture": "/assets/images/Brenda - Programmes Coordinator.jpg",
      "alt_pic": "Brenda Kaloki | Programme Coordinator",
      "class_style": "team-item team-item2"
    },
    {
      "name": "Eunice Mulinge",
      "designation": "Welfare Overseer",
      "picture": "/assets/images/Eunice - Children Welfare Overseer.jpg",
      "alt_pic": "Eunice Mulinge | Welfare Overseer",
      "class_style": "team-item team-item3"
    },
    {
      "name": "Margaret Munyambu",
      "designation": "Senior Social Worker",
      "picture": "/assets/images/Margaret - Senior Social Worker.jpg",
      "alt_pic": "Margaret Munyambu | Center Manager & SSW",
      "class_style": "team-item team-item4"
    },
    {
      "name": "Jenipher Samson",
      "designation": "School HeadTeacher",
      "picture": "/assets/images/our-team-page-8.jpg",
      "alt_pic": "Jenipher Samson | Head Teacher",
      "class_style": "team-item team-item1"
    },
    {
      "name": "Collins Keverenge",
      "designation": "Deputy School HeadTeacher",
      "picture": "/assets/images/our-team-page-10.jpg",
      "alt_pic": "Collins Keverenge | Deputy HeadTeacher",
      "class_style": "team-item team-item2"
    },
    {
      "name": "Veronicah Karithu",
      "designation": "ECD Manager",
      "picture": "/assets/images/Veronicah-Karithu.jpeg",
      "alt_pic": "Veronicah Karithu | ECD Manager",
      "class_style": "team-item team-item3"
    },
    {
      "name": "Jacqueline Amanyole",
      "designation": "Transition Programme Coordinator",
      "picture": "/assets/images/Jacqueline-Amonyole.jpg",
      "alt_pic": "Jacqueline Amanyole | Transition Programme Coordinator",
      "class_style": "team-item team-item4"
    },
    {
      "name": "Pastor David",
      "designation": "Discipleship Pastor",
      "picture": "/assets/images/our-team-page-9.jpg",
      "alt_pic": "Pastor David | Discipline",
      "class_style": "team-item team-item1"
    },
    {
      "name": "Rose Amukoye",
      "designation": "Community Library Manager",
      "picture": "/assets/images/Rose - Community Library Manager.jpg",
      "alt_pic": "Rose Amukoye | Community Library Manager",
      "class_style": "team-item team-item2"
    },
    {
      "name": "Nathan Manywanda",
      "designation": "TPFC Coach",
      "picture": "/assets/images/Brian - TPFC Coach.jpg",
      "alt_pic": "Nathan Manywanda | TPFC Coach",
      "class_style": "team-item team-item3"
    },
    {
      "name": "Leonard Orieny",
      "designation": "ICT Manager",
      "picture": "/assets/images/our-team-page-6.jpg",
      "alt_pic": "Leonard Orieny | ICT Manager",
      "class_style": "team-item team-item4"
    },
    {
      "name": "Eric Gaka",
      "designation": "Fundraising, Communications & Marketing Manager",
      "picture": "/assets/images/Eric-Gaka.jpg",
      "alt_pic": "Eric Gaka | Fundraising & Communications Manager",
      "class_style": "team-item team-item1"
    },
    {
      "name": "Sharon Karanja",
      "designation": "Admin/HR Officer",
      "picture": "/assets/images/our-team-page-7.jpg",
      "alt_pic": "Sharon Karanja | Administrator",
      "class_style": "team-item team-item2"
    },
    {
      "name": "Jackline Waweru",
      "designation": "Accounts Officer",
      "picture": "/assets/images/Jackline-Waweru.jpg",
      "alt_pic": "Jackline Waweru | Accounts Officer",
      "class_style": "team-item team-item3"
    }
  ],
  "causes": [
    {
      "id": 1,
      "cause_name": "Bibles",
      "description": "£5 will purchase a bible for a child, enabling them to learn about the love of God. Pastors teach our kids from the bible and help them apply what they learn in their daily lives.",
      "preview": "£5 will purchase a bible for a child, enabling them to learn about the love of God.",
      "goal": "5.00",
      "raised": "0.00",
      "themeBtn": 1,
      "image": "/assets/images/cause-bible.jpg"
    },
    {
      "id": 2,
      "cause_name": "Stationery",
      "description": "£5 provides all the pens, pencils and exercise books one child needs for a year in our Transition Class. In this class, street-children are rehabilitated and prepare to return to school.",
      "preview": "£5 provides all the pens, pencils and exercise books one child needs for a year.",
      "goal": "5.00",
      "raised": "0.00",
      "themeBtn": 2,
      "image": "/assets/images/cause-pre-school-supplies-1.jpg"
    },
    {
      "id": 3,
      "cause_name": "School Dinners",
      "description": "£15 will serve up breakfast and lunch to a child every weekday for one month. Daily food ensures children turn up to school everyday and are not tempted by hunger back to the streets.",
      "preview": "£15 will serve up breakfast and lunch to a child every weekday for one month.",
      "goal": "15.00",
      "raised": "0.00",
      "themeBtn": 3,
      "image": "/assets/images/cause-school-dinners.jpg"
    },
    {
      "id": 4,
      "cause_name": "School Trip",
      "description": "£20 will take 10 children on a school trip. These trips expose children to life beyond the slum and provide fun opportunities to learn about Kenya's history, natural environment and culture.",
      "preview": "£20 will take 10 children on a school trip. Expose children to life beyond the slum.",
      "goal": "20.00",
      "raised": "0.00",
      "themeBtn": 1,
      "image": "/assets/images/cause-school-trips.jpg"
    },
    {
      "id": 5,
      "cause_name": "Library Books",
      "description": "With £6 we can purchase 2 new books for the Community Library in Kibera. Here children come after school and during holidays to do homework, read stories or read up on their favourite subjects.",
      "preview": "With £6 we can purchase 2 new books for the Community Library in Kibera.",
      "goal": "6.00",
      "raised": "0.00",
      "themeBtn": 2,
      "image": "/assets/images/cause-library-books.jpg"
    },
    {
      "id": 6,
      "cause_name": "Art Supplies",
      "description": "£10 will provide art supplies for the children at the Fountains of Hope Primary School to explore their creative sides through drawing, painting and crafts. Children will get a chance to develop their talents.",
      "preview": "£10 will provide art supplies the children use to explore their creative sides.",
      "goal": "10.00",
      "raised": "0.00",
      "themeBtn": 3,
      "image": "/assets/images/cause-art-supplies.jpg"
    },
    {
      "id": 7,
      "cause_name": "Football",
      "description": "£15 will help to equip our after-school football club with footballs, kits, bibs, boots and more. The club keeps children off the street and engaged in a healthy activity. The football club also offers kids friendship and discipleship.",
      "preview": "£15 will help to equip our after-school football club with footballs kits.",
      "goal": "15.00",
      "raised": "0.00",
      "themeBtn": 1,
      "image": "/assets/images/cause-football.jpg"
    },
    {
      "id": 8,
      "cause_name": "Secondary School Support",
      "description": "£35 supports a child at the Fountains of Hope Primary School for one month. This covers tuition, learning resources and daily meals. Children receive a quality education from our committed team.",
      "preview": "£35 supports a child at the Fountains of Hope Primary School for one month.",
      "goal": "35.00",
      "raised": "0.00",
      "themeBtn": 2,
      "image": "/assets/images/cause-school-support.jpg"
    },
    {
      "id": 9,
      "cause_name": "Pre-School Support",
      "description": "£20 will help to equip a pre-school classroom with all the puzzles, playdough, building blocks, paint, glue and crayons needed to give kids a head start in education. Children learn as they play guided by our expert teachers.",
      "preview": "£20 will help to equip a pre-school classroom with all the puzzles and playdough.",
      "goal": "20.00",
      "raised": "0.00",
      "themeBtn": 3,
      "image": "/assets/images/cause-pre-school-supplies.jpg"
    }
  ],
  "events": [
    {
      "id": 1,
      "name": "Save the planets",
      "description": "There are many variations of passages of Lorem Ipsum available,\n                                    but the majority have suffered alteration in some form, by injected humour,\n                                    or randomised words which don't look even slightly believable.\n                                    If you are going to use a passage of Lorem Ipsum,\n                                    you need to be sure there isn't anything embarrassing hidden in the middle of text.",
      "day": "6",
      "month": "May",
      "time": "8:00AM TO 2:00PM",
      "location": "Kibera",
      "themeId": 1
    },
    {
      "id": 2,
      "name": "Pray for the world",
      "description": "There are many variations of passages of Lorem Ipsum available,\n                                    but the majority have suffered alteration in some form, by injected humour,\n                                    or randomised words which don't look even slightly believable.\n                                    If you are going to use a passage of Lorem Ipsum,\n                                    you need to be sure there isn't anything embarrassing hidden in the middle of text.",
      "day": "9",
      "month": "May",
      "time": "8:00AM TO 2:00PM",
      "location": "Kibera",
      "themeId": 2
    },
    {
      "id": 3,
      "name": "Water for charity",
      "description": "There are many variations of passages of Lorem Ipsum available,\n                                    but the majority have suffered alteration in some form, by injected humour,\n                                    or randomised words which don't look even slightly believable.\n                                    If you are going to use a passage of Lorem Ipsum,\n                                    you need to be sure there isn't anything embarrassing hidden in the middle of text.",
      "day": "4",
      "month": "Mar",
      "time": "8:00AM TO 2:00PM",
      "location": "Kibera",
      "themeId": 3
    },
    {
      "id": 4,
      "name": "Help for education",
      "description": "There are many variations of passages of Lorem Ipsum available,\n                                    but the majority have suffered alteration in some form, by injected humour,\n                                    or randomised words which don't look even slightly believable.\n                                    If you are going to use a passage of Lorem Ipsum,\n                                    you need to be sure there isn't anything embarrassing hidden in the middle of text.",
      "day": "2",
      "month": "Mar",
      "time": "8:00AM TO 2:00PM",
      "location": "Kibera",
      "themeId": 4
    },
    {
      "id": 5,
      "name": "Fight for right cause",
      "description": "There are many variations of passages of Lorem Ipsum available,\n                                    but the majority have suffered alteration in some form, by injected humour,\n                                    or randomised words which don't look even slightly believable.\n                                    If you are going to use a passage of Lorem Ipsum,\n                                    you need to be sure there isn't anything embarrassing hidden in the middle of text.",
      "day": "11",
      "month": "Apr",
      "time": "8:00AM TO 2:00PM",
      "location": "Kibera",
      "themeId": 1
    },
    {
      "id": 6,
      "name": "Protect eco system",
      "description": "There are many variations of passages of Lorem Ipsum available,\n                                    but the majority have suffered alteration in some form, by injected humour,\n                                    or randomised words which don't look even slightly believable.\n                                    If you are going to use a passage of Lorem Ipsum,\n                                    you need to be sure there isn't anything embarrassing hidden in the middle of text.",
      "day": "22",
      "month": "May",
      "time": "8:00AM TO 2:00PM",
      "location": "Kibera",
      "themeId": 2
    }
  ],
  "sponsors": [
    {
      "id": 1,
      "name": "AAR",
      "location": "nairobi, kenya",
      "description": "AAR Healthcare Kenya Limited is a subsidiary of AAR Healthcare Holdings Limited operating in Kenya as one of the leading medical service providers in the country. As pioneers in the provision of private healthcare in the region,",
      "logo": "/assets/images/partners/AAR%20logo.jpg",
        "website": "https://www.aar-healthcare.com/ke/"
    },
    {
      "id": 2,
      "name": "Ambassadors Football Academy",
      "location": "nairobi, kenya",
      "description": "AF work continues on through football camps, clinics, prison ministry, school ministry, men’s and women’s teams, international tours and major event ministries at the World Cup and Olympics Games.",
      "logo": "/assets/images/partners/AF%20Academy.png",
      "website": "https://www.ambassadorsfootball.org/kenya/"
    },
    {
      "id": 3,
      "name": "Cheza Sports",
      "location": "nairobi, kenya",
      "description": "Cheza Sports Academy has the aspiration of discovering, nurturing, developing and enhancing growth of potential talent in football through youth programmes. Hence, it exists with a sole of ensuring the development of all –rounded young football professionals with the ability to keep the football game more vibrant than ever before.",
      "logo": "/assets/images/partners/Cheza%20sports.png",
      "website": "https://www.chezasports.co.ke/"
    },
    {
      "id": 4,
      "name": "Daraja",
      "location": "nairobi, kenya",
      "description": "Daraja Academy provides a safe place for girls who would not have access to a high school education any other way. It is a beacon of hope, safety, and future promise for marginalized girls to grow their innate leadership skills. Daraja provides a rigorous academic program to prepare girls for the KCSE (Kenya Certificate of Secondary Education) national exams and future admission to college and university.",
      "logo": "/assets/images/partners/Daraja-logo.png",
      "website": "https://www.daraja-academy.org/"
    },
    {
      "id": 5,
      "name": "Garden of Hope Foundation",
      "location": "nairobi, kenya",
      "description": "A NGO passionate about restoring hope to underserved youth, children, women, and girls from urban slums and rural communities through providing mentorship, leadership, and youth empowerment.",
      "logo": "/assets/images/partners/Garden%20of%20Hope.png",
      "website": "https://www.gardenofhopefoundation.org/"
    },
    {
      "id": 6,
      "name": "Kibera Girls Soccer Academy",
      "location": "nairobi, kenya",
      "description": "The KGSA Foundation partners with the Kibera Girls School Soccer Academy (KGSA) to provide a free, holistic high school education to 150 girls living in the Kibera area of Nairobi, Kenya, one of Africa’s largest informal settlements.",
      "logo": "/assets/images/partners/KGSA%20logo.jpg",
      "website": "https://www.kgsafoundation.org/"
    },
    {
      "id": 7,
      "name": "Krafts Therapy Foundation",
      "location": "nairobi, kenya",
      "description": "Krafts Therapy Foundation is a platform that not only fosters women economic empowerment through tailoring but one that encourages community involvement through joining hands with other artisans who would like to transfer other relevant skills to the society.",
      "logo": "/assets/images/partners/Kraft%20Therapy.png",
      "website": "https://l.instagram.com/?u=http%3A%2F%2Fkraftstherapy.foundation%2F&e=AT0Lp-5TaTancgMZyHT_xqSnwlQJOHJaQ0hPE5UrUa7d4uJuEcZJxJiSlrnQF4JWwNZM2cVw2N7td0XQGUgQsf9DcJS3T66xWlTEEw"
    },
    {
      "id": 8,
      "name": "Slums Going Green and Clean",
      "location": "nairobi, kenya",
      "description": "A community-based organization (CBO) that works to improve the living conditions in informal settlements such as slums by promoting environmental sustainability and cleanliness.",
      "logo": "/assets/images/partners/SGGC%20Logo.png",
      "website": "https://www.slumsgoinggreenandclean.org/sggc/"
    },
    {
      "id": 9,
      "name": "Shining Hope for Communities",
      "location": "nairobi, kenya",
      "description": "A grassroots movement that catalyzes large-scale transformation in urban slums by providing critical services for all, community advocacy platforms, and education and leadership development for women and girls.",
      "logo": "/assets/images/partners/shofco-logo.png",
      "website": "https://www.shofco.org/"
    },
    {
      "id": 10,
      "name": "Uweza Foundation",
      "location": "nairobi, kenya",
      "description": "We Empower Children And Youth In Kibera, Kenya To Pursue A Path To A Better Future Through The Discovery And Development Of Their Talents And Abilities.",
      "logo": "/assets/images/partners/Uweza%20Foundation.jpg",
      "website": "https://www.uwezakenya.org/"
    },
    {
      "id": 11,
      "name": "Watoto Wasome",
      "location": "nairobi, kenya",
      "description": "We harness the transformative potential of child-centred learning, along with our unique access to children in underserved communities. We proudly collaborate with passionate directors and the government to improve children’s literacy levels within the country.",
      "logo": "/assets/images/partners/Watoto%20wasome%20logo.png",
      "website": "https://www.watotowasome.org/"
    },
    {
      "id": 12,
      "name": "Zizi Afrique",
      "location": "nairobi, kenya",
      "description": "An organization committed to improving learning outcomes for children and youth furthest behind. They contribute to the nurturing of a generation of children and youth who are well-equipped with skills for learning, skills for living and skills for working industry been the industry's standard dummy text ever since.",
      "logo": "/assets/images/partners/Zizi%20logo.png",
      "website": "https://ziziafrique.org/"
    },
    {
      "id": 13,
      "name": "Fútbol Más",
      "location": "nairobi, kenya",
      "description": "Respect, joy, responsibility, creativity and teamwork. these are the core values we work on through play and sport. fútbol más goes to the very heart of neighbourhoods, schools, residences, refugee centres and natural emergencies in africa, europe and latin america.",
      "logo": "/assets/images/partners/Futbolmas Logo.png",
      "website": "https://ziziafrique.org/"
    }
  ],
  "ourImpact": [
    {
      "id": 1,
      "name": "2021 Impact Report",
      "description": "In 2021 , the Kenyan Ministry of Education condensed the school year to catch up on the learning lost to the pandemic in 2020. As a result, the year was busy and challenging. Despite this, our staff have managed to achieve incredible things as seen in this report.\n",
      "pdf": "/assets/documents/Impact-Report-2021.pdf",
      "image": "/assets/images/impact-report-2021.png"
    },
    {
      "id": 2,
      "name": "2020 Impact Report",
      "description": "2020 was a challenging year for everyone due to COVID, but that did not stop us from impacting the lives of our children and their families. As you will read in this report, we were able to continue providing meals to the children we serve and support home learning. We also got the opportunity to engage in the community of Kibera by creating awareness about the virus and providing handwashing stations accessible to anyone.\n",
      "pdf": "/assets/documents/Impact-Report-2020.pdf",
      "image": "/assets/images/impact-report-2020.png"
    },
    {
      "id": 3,
      "name": "2019 Impact Report",
      "description": "God has enabled us to empower more children and families in Kibera throughout the past year. You will read in this report about the impact we have achieved including supporting 143 children in primary school and 63 children in secondary school. Preparing 25 more children to join or return to school and over a thousand children have benefitted from our community library.\n",
      "pdf": "/assets/documents/Impact-Report-2019.pdf",
      "image": "/assets/images/impact-report-2019.png"
    },
    {
      "id": 4,
      "name": "2018 Impact Report",
      "description": "2018 was a good year! Great strides and achievements!\nIt was a huge milestone for us to have our first cohort of children sitting their final primary national exams in our own school. They did very well and we had 100% transition to secondary school. We returned 25 children to primary school and the Community Library offered space and support to many children throughout the year. Despite funding challenges, we gave the children the best we could. I am proud to say we ended the year on a great note.\n",
      "pdf": "/assets/documents/Impact-Report-2018.pdf",
      "image": "/assets/images/impact-report-2018.png"
    },
    {
      "id": 5,
      "name": "2017 Impact Report",
      "description": "In 2017, Turning Point continued to support children to reach their full God-given potential and worked to build stronger relationships with parents and the wider community. We saw the Fountain of Hope School grow inn capacity and in efficiency. We focused our efforts on improving the internal systems of the organization, especially the school.\n",
      "pdf": "/assets/documents/Impact-Report-2017.pdf",
      "image": "/assets/images/impact-report-2017.png"
    },
    {
      "id": 6,
      "name": "2016 Impact Report",
      "description": "During 2016 we have continued to see the Fountain of Hope School grow and support more children, providing a holistic education to the children we serve. Providing a high quality education remains at the heart of what we do, and is also supported by our transition class and community Library.\n",
      "pdf": "/assets/documents/Impact-Report-2016.pdf",
      "image": "/assets/images/impact-report-2016.png"
    },
    {
      "id": 7,
      "name": "2015 Impact Report",
      "description": "2015 has been a significant year for Turning Point in Kenya. We achieved a smooth handover of the CEO role from Jon Parsons to Judy Akoth. We are enormously grateful to Jon and Jo Parsons for their work in Kenya as the founders and those who led it as it grew. We are also delighted that Judy has taken over as CEO and made such a positive start. It has been an aim of Turning Point to be more Kenyan led, and we are very pleased to have achieved this milestone.\n",
      "pdf": "/assets/documents/Impact-Report-2015.pdf",
      "image": "/assets/images/impact-report-2015.png"
    },
    {
      "id": 8,
      "name": "2022 Impact Report",
      "description": "In 2022, we moved a step higher to improve the quality of work by streamlining the existing systems and structures, staff training and development, collective project planning and monitoring and evaluation. We also started some work to review our partnerships engagement as well as thinking about how we can be more involved in the Kibera community. These have contributed to great results in the year as seen in this report.\n",
      "pdf": "/assets/documents/Impact-Report-2022.pdf",
      "image": "/assets/images/impact-report-2022.jpg"
    }
  ],
  "tptrustBackground" : "The Turning Point Trust is a UK-registered charity and a registered non-governmental organization(NGO) in Kenya formed in 2003 to serve vulnerable children and families in the Kibera informal settlement in Nairobi, Kenya.<br /><br />On the 3rd of March 2003, our founders Jo and Jon Parsons, together with the very first staff members:\nJohn Kariuki, Rev. Shadrack Mulinge and Eunice Mulinge, began Turning Point&#39;s journey of seeking\nvulnerable children. On this day, it all started with a pot of porridge and seven children. Over time, the\nnumbers grew, and they knew those that came daily were those who needed to benefit, hence the need\nto start an education programme for the children to attend.<br /><br />For 20 years, we have helped vulnerable children and their families by running a holistic range of\nprogrammes to achieve our vision of seeing children and families in Kibera achieving their full God-given\npotential.\nThe programmes we offer include, a remedial education programme; a free pre-school and primary\nschool; secondary school support, and a community library.<br /><br />To achieve holistic value, we run a school\nfeeding programme, a discipleship programme, a psychosocial support programme and after-school\nactivities alongside the education programmes.\nOur mission has been to demonstrate God&#39;s heart for the poor by offering programmes that relieve\npoverty, transform lives, and restore hope."
}
